Repository: GitMirroring/www-tr
Catalog: distros/common-distros.*.po
Languages: tr

source: Explaining Why We Don't Endorse Other Systems - GNU Project - Free Software Foundation
tr: Diğer Sistemleri Neden Desteklemediğimizi Açıklıyoruz - GNU Projesi - Özgür Yazılım Vakfı

source: Free GNU/Linux distributions
tr: Özgür GNU/Linux Dağıtımları

source: Explaining Why We Don't Endorse Other Systems
tr: Diğer Sistemleri Neden Desteklemediğimizi Açıklıyoruz

source: We're often asked why we don't endorse a particular system&mdash;usually a popular GNU/Linux distribution. The short answer to that question is that they don't follow the <a href="/distros/free-system-distribution-guidelines.html">free system distribution guidelines</a>. But since it isn't always obvious how a particular distro fails to follow the guidelines, this list gives more information about the problems of certain well-known nonfree system distros.
tr: Sıklıkla belirli bir sistemi (genellikle popüler bir GNU/Linux dağıtımı) niçin onaylamadığımız soruluyor. Bu sorunun kısa yanıtı <a href="/distros/free-system-distribution-guidelines.html">özgür sistem dağıtım kurallarına</a> uymamalarıdır. Ancak belirli bir dağıtımın kurallara neden uymadığı her zaman açık olmadığı için, bu liste bazı ünlü özgür olmayan sistem dağıtımlarının sorunları hakkında daha fazla bilgi veriyor.

source: To learn more about the GNU/Linux systems that we do endorse, check out our list of <a href="/distros/free-distros.html">free GNU/Linux distributions</a>.
tr: Desteklediğimiz GNU/Linux sistemleri hakkında daha fazla bilgi edinmek için <a href="/distros/free-distros.html">özgür GNU/Linux dağıtımları</a> listemize göz atabilirsiniz.

source: Except where noted, all of the distributions listed on this page fail to follow the guidelines in at least two important ways:
tr: Ayrıca belirtilen durumlar dışında, bu sayfada listelenen tüm dağıtımların yönergeleri izlemekte başarısız olduğu en az iki önemli durum söz konusu:

source: They do not have a policy of <em>only</em> including free software, and removing nonfree software if it is discovered. Most of them have no clear policy on what software they'll accept or reject at all. The distributions that do have a policy unfortunately aren't strict enough, as explained below.
tr: <em>Yalnızca</em> özgür yazılımlar içeren ve keşfedildiğinde özgür olmayan yazılımı kaldıracakları bir ilkeye sahip değiller. Çoğu, hangi yazılımı kabul edeceği veya reddedeceği konusunda net bir politikaya sahip değil. Bir politikaya sahip olan dağıtımlar maalesef aşağıda açıklandığı gibi yeterince katı değiller.

source: The kernel that they distribute (in most cases, Linux) includes &ldquo;blobs&rdquo;: pieces of object code distributed without source, usually firmware to run some device.
tr: Dağıttıkları çekirdek (çoğu durumda Linux) &ldquo;blob’lar&rdquo; içeriyor: kaynak kod olmadan dağıtılan program parçaları, genellikle bazı aygıtları çalıştırmak için donanım yazılımı (firmware).

source: Here is a list of some popular nonfree GNU/Linux distributions in alphabetical order, with brief notes about how they fall short. We do not aim for completeness; once we know some reasons we can't endorse a certain distro, we do not keep looking for all the reasons.
tr: Alfabetik sıraya göre bazı popüler ve özgür olmayan GNU/Linux dağıtımlarının bir listesi aşağıdadır. Bütünlüğü hedeflemiyoruz: belirli bir dağıtım hakkında bazı nedenleri farkettiğimizde onu desteklemiyoruz, bütün nedenleri araştırmaya devam etmiyoruz.

source: A distro may have changed since we last updated information about it; if you think one of the problems mentioned here has been corrected, please <a href="mailto:webmasters@gnu.org">let us know</a>. However, we will study and endorse a distro only if its developers ask for our endorsement.
tr: Son güncellemeden bu yana bir dağıtım değişmiş olabilir: Burada sözü edilen sorunlardan birinin giderildiğini düşünüyorsanız lütfen <a href="mailto:webmasters@gnu.org">bize bildirin</a>. Bununla birlikte yalnızca geliştiricileri onayımızı isterse bir dağıtımı inceleyeceğiz ve onaylayacağız.

source: Arch has no policy against distributing nonfree software through their normal channels, and nonfree blobs are shipped with their kernel, Linux.
tr: Arch iki alışılmış problemi içeriyor: hangi yazılımın dâhil edilebileceği konusunda net bir politika yok ve özgür olmayan blob’lar çekirdek (Linux) ile birlikte geliyor. Arch ayrıca özgür olmayan yazılımları normal kanalları üzerinden dağıtmama konusunda da bir politikaya sahip değildir.

source: Canaima GNU/Linux is a distribution made by Venezuela's government to distribute computers with GNU/Linux. While the overall plan is admirable, Canaima is flawed by the inclusion of nonfree software.
tr: Canaima GNU/Linux, Venezuela hükûmetinin bilgisayarları GNU/Linux ile dağıtmaya yönelik yaptığı bir dağıtımdır. Genel plan takdire şayan olsa da özgür olmayan yazılımın eklenmesiyle Canaima kusurludur.

source: Its main menu has an option, &ldquo;Install nonfree software,&rdquo; which installs all the nonfree drivers (even the ones that are not necessary). The distro also ships blobs for the kernel, Linux, and invites installing nonfree applications including Flash Player.
tr: Ana menüsü, tüm özgür olmayan sürücüleri (gerekli olmayanları bile) yükleyen &ldquo;Özgür olmayan yazılımı yükle&rdquo; seçeneğine sahiptir. Dağıtım ayrıca çekirdek (Linux) içinde bloblarla birlikte geliyor ve Flash Player dâhil olmak üzere özgür olmayan uygulamaları kurmayı teşvik ediyor.

source: We're not aware of problems in CentOS aside from the two usual ones: there's no clear policy about what software can be included, and nonfree blobs are shipped with Linux, the kernel. Of course, with no firm policy in place, there might be other nonfree software included that we missed.
tr: CentOS’taki sorunların her zamanki iki sorunun yanı sıra farkında değiliz: Hangi yazılımın dâhil edilebileceği konusunda net bir politika yoktur ve özgür olmayan blob’lar, Linux (çekirdek) ile birlikte gönderilir.

source: Until 2022, Debian GNU/Linux came fairly close to qualifying as a free distro: it was simple to specify that you wanted to install Debian without any nonfree software.
tr: 2022 yılına kadar Debian GNU/Linux özgür bir yazılım olarak değerlendirilmeye çok yakındı; Debian'ı herhangi bir özgür olmayan yazılımsız kurma isteğini belirtmeniz kolaydı.

source: Debian's Social Contract states the goal of making Debian entirely free software, and Debian conscientiously keeps nonfree software out of the official Debian system. However, Debian also maintains a repository of nonfree software. It asserts that this software is &ldquo;not part of the Debian system,&rdquo; but the repository is hosted on many of the project's main servers, so people are likely to learn from Debian itself about those nonfree packages by browsing Debian's package database and wiki, and then might install them.
tr: Debian’ın Toplumsal Sözleşmesi, Debian’ı tamamen özgür bir yazılım hâline getirmeyi hedefliyor ve Debian, özgür olmayan yazılımı resmî Debian sisteminden bilinçli olarak koruyor. Bununla birlikte Debian, ayrıca özgür olmayan bir yazılım deposu da sağlıyor. Projeye göre bu yazılım, &ldquo;Debian sisteminin bir parçası değil&rdquo;, ancak depo, projenin ana sunucularının birçoğunda barındırılıyor, böylece insanlar büyük ihtimalle bu özgür olmayan paketleri Debian’ın çevrimiçi paket veritabanına ve viki’sine bakarak Debian'ın kendisinden öğrenebilir ve daha sonra kurabilirler. Yine de, en azından, Debian kullanıcılar istemedikçe bu paketleri kurmuyor.

source: Until 2022, Debian GNU/Linux did not offer nonfree packages for installation unless the user explicitly enabled use of that repository. Thus, it was easy to make a free installation if you wanted to.
tr: 2022 yılında kadar, Debian GNU/Linux, kullanıcı bu deponun kullanımını açıkça etkinleştirmedikçe özgür olmayan paketleri önermiyordu. Böylece, isteğiniz doğrultusunda özgür bir kurulum yapmak kolaydı.

source: That is no longer true, because Debian has <a href="https://lists.debian.org/debian-devel-announce/2022/10/msg00001.html"> changed its policy</a>. In Debian 12, initially, the installer offered to install nonfree firmware whenever some hardware devices &ldquo;needed&rdquo; that.
tr: Bu artık doğru değil, çünkü Debian <a href="https://lists.debian.org/debian-devel-announce/2022/10/msg00001.html">politikasını değiştirdi</a>. Debian 12'de, başlangıçta, kurulum sihirbazı bazı donanım aygıtları &ldquo;ihtiyaç duyduğunda&rdquo; özgür olmayan aygıt yazılımlarını kurmayı öneriyor.

source: Since then, there has been another change for the worse. Debian now recommends preferentially a new installer program which, on most computers, installs all the nonfree firmware without even asking.
tr: O zamandan beri, daha da kötü bir değişiklik oldu. Debian şimdi tercihen yeni bir kurulum programı öneriyor, bu program çoğu bilgisayarda sormadan tüm özgür olmayan aygıt yazılımlarını kuruyor.

source: It is no longer easy to install only the free packages of Debian. In effect, Debian has become more like the other nonfree distros.
tr: Artık Debian'ın sadece özgür paketlerini kurmak o kadar da kolay değil. Aslında Debian da diğer özgür olmayan dağıtımlar gibi oldu.

source: Debian also has a &ldquo;contrib&rdquo; repository; its packages are free, but some of them exist to load separately distributed proprietary programs. This too is not thoroughly separated from the main Debian distribution.
tr: Debian'ın ayrıca bir &ldquo;contrib&rdquo; deposu var: Paketleri özgürdür, ancak bazıları ayrı olarak dağıtılan sahipli programları yüklemek için var. Bu da ana Debian dağıtımından tamamen ayrı değildir.

source: In addition, some of the free programs that are officially part of Debian invite the user to install some nonfree programs. Specifically, the Debian versions of Firefox and Chromium suggest nonfree plug-ins to install into them.
tr: Ek olarak, Debian'ın resmi parçası olan bazı özgür programlar kullanıcıları bazı özgür olmayan programlar kurmaya teşvik ediyor. Özellikle, Firefox ve Chromium tarayıcılarının Debian sürümleri özgür olmayan eklentileri onlarla birlikte kurmayı öneriyor.

source: Debian's wiki also includes pages about installing nonfree firmware.
tr: Debian’ın wiki’sinde özgür olmayan ürün yazılımı (firmware) kurulumu ile ilgili sayfalar bulunuyor.

source: Fedora does have a clear policy about what can be included in the distribution, and it seems to be followed carefully. The policy requires that most software and all fonts be available under a free license, but makes an exception for certain kinds of nonfree firmware. Unfortunately, the decision to allow that firmware in the policy keeps Fedora from meeting the free system distribution guidelines.
tr: Fedora, dağıtımda nelerin dâhil edilebileceğine dair net bir politikaya sahiptir ve dikkatle takip edilmektedir. İlke, çoğu yazılımın ve tüm yazı tiplerinin özgür bir lisans kapsamında bulunmasını gerektirir ancak belirli türdeki özgür olmayan ürün yazılımı (firmware) için bir istisna oluşturur. Ne yazık ki bu ürün yazılımı (firmware) politikasına izin verme kararı, Fedora’nın özgür sistem dağıtım kurallarına uymasını engellemektedir.

source: Gentoo includes installation recipes for a number of nonfree programs in its primary package system.
tr: Gentoo, birincil paket sisteminde bir dizi özgür olmayan program için kurulum tarifleri içerir.

source: Mandriva does have a stated policy about what can be included in the main system. It's based on Fedora's, which means that it also allows certain kinds of nonfree firmware to be included. On top of that, it permits software released under the original Artistic License to be included, even though that's a nonfree license.
tr: Mandriva’nın ana sisteme neyin dâhil edilebileceği konusunda bir politika var. Fedora’ya dayanıyor, bu da belirli türdeki özgür olmayan yazılımın dâhil edilmesine izin verdiği anlamına geliyor. Bunun da ötesinde özgür olmayan bir lisans olsa da özgün Sanatsal Lisans (original Artistic License) kapsamında yayımlanan yazılımların dâhil edilmesine izin veriyor.

source: Mandriva also ships nonfree software through dedicated repositories.
tr: Mandriva ayrıca adanmış depolar üzerinden özgür olmayan yazılım sağlıyor.

source: Manjaro includes nonfree software through its normal channels, and ships nonfree blobs with its kernel, Linux. It includes a proprietary office suite and proprietary games with DRM. The distro also recommends the installation of nonfree drivers.
tr: Manjaro normal kanalları aracılığıyla özgür olmayan yazılım barındırıyor ve Linux çekirdeğinde özgür olmayan kısımlarla birlikte geliyor. Özel mülkiyet bir ofis yazılım ve DRM barındıran özel mülk oyunlar içeriyor. Bu dağıtım ayrı özgür olmayan sürücüleri kurmayı öneriyor.

source: Mint does not have a policy against including nonfree software, it includes nonfree binary blobs in drivers packaged with the kernel, and it includes nonfree programs in its repositories. It even includes proprietary codecs.
tr: Mint; özgür olmayan yazılım içermeyen bir politikaya sahip değildir, çekirdekle paketlenmiş sürücülerde özgür olmayan ikili blob’ları içerir ve depolarında özgür olmayan programlar içerir. Hatta sahipli çözücüler (codec’ler) içerir.

source: NixOS doesn't have any policy that completely forbids nonfree software. Instead, it has an option that needs to be activated to install nonfree packages. But even with that option disabled, it still ships nonfree blobs in its main repository, either with Linux (the kernel), or through separate package(s) like <a href="/philosophy/tivoization.html">sof-firmware</a>.
tr: NixOS'un özgür olmayan yazılımı tamamen yasaklayan herhangi bir politikası yok. Bunun yerine özgür olmayan paketlerin yüklenmesi için etkinleştirilmesi gereken bir seçeneği var. Ama bu seçenek devre dışı olsa bile ana deposunda, ya Linux (çekirdeği) ile ya da <a href="/philosophy/tivoization.html">ses aygıt yazılımları</a> gibi farklı paketler aracılığıyla özgür olmayan kod yığınlarını barındırıyor.

source: openSUSE offers a repository of nonfree software. This is an instance of how <a href="/philosophy/open-source-misses-the-point.html"> &ldquo;open&rdquo; is weaker than &ldquo;free&rdquo;</a>.
tr: openSUSE, özgür olmayan bir yazılım deposu sunar. Bu, <a href="/philosophy/open-source-misses-the-point.html">&ldquo;açık&rdquo;ın “özgür”den daha zayıf olmasının</a> bir örneğidir.

source: Red Hat's enterprise distribution primarily follows the same licensing policies as Fedora, with one exception. Thus, we don't endorse it for <a href="#Fedora">the same reasons</a>. In addition to those, Red Hat has no policy against making nonfree software available for the system through supplementary distribution channels.
tr: Red Hat’ın kurumsal dağıtımı, bir istisna dışında, öncelikle Fedora ile aynı lisans politikalarını takip eder. Bu nedenle <a href="#Fedora">aynı sebeplerden</a> dolayı onaylamıyoruz. Bunlara ek olarak Red Hat, ek dağıtım kanalları aracılığıyla sisteme özgür olmayan yazılım yapma konusunda bir politikaya sahip değildir.

source: Slackware has the two usual problems: there's no clear policy about what software can be included, and nonfree blobs are included in Linux, the kernel. It also ships with the nonfree image-viewing program xv. Of course, with no firm policy against them, more nonfree programs could get in at any time. There is an <a href="http://freeslack.net/">unofficial list</a> of nonfree software in Slackware.
tr: Slackware’nin iki olağan sorunu var: Hangi yazılımın dâhil edilebileceğine dair net bir politika yok ve Linux’a (çekirdek) özgür olmayan blob’lar dâhildir. Ayrıca özgür olmayan görüntü izleme programı xv ile birlikte gönderilir. Elbette, onlara karşı kesin bir politika olmadan özgür olmayan programlar her an içeri girebilir. Slackware’de özgür olmayan yazılımın <a href="http://freeslack.net/">resmî olmayan bir listesi</a> var.

source: SteamOS, a version of GNU/Linux to be distributed by Valve. It contains proprietary software, including the Steam client and proprietary drivers. Steam uses <a href="https://www.defectivebydesign.org/what_is_drm_digital_restrictions_management">Digital Restrictions Management (DRM)</a> to impose restrictions on the software it distributes, as well as on the proprietary software it promotes via the Steam store.
tr: SteamOS, Valve tarafından dağıtılacak GNU/Linux sürümü. Steam istemcisi ve özel mülkiyet sürücüler de dâhil olmak üzere özel mülkiyet bir yazılım içerir. Steam, dağıttığı yazılımın yanı sıra Steam mağazası aracılığıyla tanıttığı özel mülkiyet yazılım üzerinde kısıtlamalar getirmek için <a href="https://www.defectivebydesign.org/what_is_drm_digital_restrictions_management">Dijital Kısıtlamalar Yönetimi (DRM)</a> kullanır.

source: In addition to the usual two problems, several nonfree software programs are available for download from SUSE's official FTP site.
tr: Her zamanki iki soruna ek olarak SUSE’nin resmî FTP sitesinden indirmek için birçok özgür olmayan yazılım programı mevcuttur.

source: Tails uses the vanilla version of Linux, which contains nonfree firmware blobs.
tr: Tails, özgür olmayan donanım yazılımı (firmware) blob’larını içeren Linux’un vanilya sürümünü kullanır.

source: Ubuntu maintains specific repositories of nonfree software, and Canonical expressly promotes and recommends nonfree software under the Ubuntu name in some of their distribution channels. Ubuntu offers the option to install only free packages, which means it also offers the option to install nonfree packages too. In addition, the version of Linux, the kernel, included in Ubuntu contains firmware blobs.
tr: Ubuntu, özgür olmayan yazılımlar için belirli depolar sağlıyor ve Canonical, bazı dağıtım kanallarında Ubuntu adı altında özgür olmayan yazılımı açıkça destekliyor ve öneriyor. Ubuntu, yalnızca ücretsiz paketleri, yani özgür olmayan paketleri de yükleme seçeneği sunuyor. Ayrıca Ubuntu’ya dâhil olan Linux’un çekirdeği, donanım yazılımı (firmware) blob’ları içeriyor.

source: Ubuntu <a href="https://www.ubuntu.com/legal/intellectual-property-policy#your-use-of-ubuntu">appears to permit commercial redistribution of exact copies with the trademarks</a>; removal of the trademarks is required only for modified versions. That is an acceptable policy for trademarks. However, the same page, further down, makes a vague and ominous statement about &ldquo;Ubuntu patents,&rdquo; without giving enough details to show whether that constitutes aggression or not.
tr: Ubuntu, <a href="https://www.ubuntu.com/legal/intellectual-property-policy#your-use-of-ubuntu">tam kopyaların ticari markalarla birlikte ticari olarak yeniden dağıtılmasına izin veriyor gibi görünüyor</a>; Ticari markaların kaldırılması sadece değiştirilmiş sürümler için gereklidir. Bu, ticari markalar için kabul edilebilir bir politikadır. Ancak, aynı sayfa, daha aşağıda, saldırganlık oluşturup oluşturmadığına ilişkin yeterli bilgi vermeden &ldquo;Ubuntu patentleri&rdquo; hakkında belirsiz ve kaygı verici bir açıklama yapıyor.

source: That page spreads confusion by using the misleading term &ldquo;<a href="/philosophy/not-ipr.html">intellectual property rights</a>,&rdquo; which falsely presumes that trademark law and patent law and several other laws belong in one single conceptual framework. Use of that term is harmful, without exception, so after making a reference to someone else's use of the term, we should always reject it. However, that is not a substantive issue about Ubuntu as a GNU/Linux distribution.
tr: Bu sayfa, marka kanunu ve patent kanunu ile diğer bazı yasaların tek bir kavramsal çerçeveye ait olduğunu yanlış bir şekilde iddia eden yanıltıcı &ldquo;<a href="/philosophy/not-ipr.html">fikrî mülkiyet hakları</a>&rdquo; terimini kullanarak karışıklık yayıyor. Bu terimin kullanımı istisnasız zararlıdır, bu nedenle başka birinin terimin kullanımına referans gösterdikten sonra her zaman onu reddetmeliyiz ancak bu, Ubuntu hakkında bir GNU/Linux dağıtımı olarak önemli bir konu değildir.

source: Some Other Distros
tr: Diğer Bazı Dağıtımlar

source: Here we discuss some well-known or significant non-GNU/Linux system distros that do not qualify as free.
tr: Burada özgür olarak nitelendirilmeyen bazı tanınmış veya GNU/Linux olmayan sistem dağıtımlarını ele alıyoruz.

source: <a href="/philosophy/android-and-users-freedom.html">Android</a> as released by Google contains many nonfree parts as well as many free parts. Most of the free parts are covered by a pushover license (not <a href="/licenses/copyleft.html">copyleft</a>), so manufacturers that distribute Android in a product sometimes make those parts nonfree as well.
tr: Google tarafından yayınlanan <a href="/philosophy/android-and-users-freedom.html">Android</a>, birçok özgür parçanın yanı sıra özgür olmayan birçok parça içeriyor. Özgür parçaların çoğu bir pushover lisansı (<a href="/licenses/copyleft.html">copyleft</a> değil) tarafından karşılanır, bu yüzden bir ürünü Android’e dağıtan üreticilerin bazen bu parçaları da özgür olmazlar.

source: BSD systems
tr: BSD Sistemleri

source: FreeBSD, NetBSD, and OpenBSD all include instructions for obtaining nonfree programs in their ports system. In addition, their kernels include nonfree firmware blobs.
tr: FreeBSD, NetBSD ve OpenBSD; port sistemlerinde özgür olmayan programlar elde etme talimatlarını içerir. Ayrıca bunların çekirdeklerinde özgür olmayan donanım yazılımı (firmware) blob’ları bulunur.

source: Nonfree firmware programs used with Linux, the kernel, are called &ldquo;blobs,&rdquo; and that's how we use the term. In BSD parlance, the term &ldquo;blob&rdquo; means something else: a nonfree driver. OpenBSD and perhaps other BSD distributions (called &ldquo;projects&rdquo; by BSD developers) have the policy of not including those. That is the right policy, as regards drivers; but when the developers say these distributions &ldquo;contain no blobs,&rdquo; it causes a misunderstanding. They are not talking about firmware blobs.
tr: Linux (çekirdek) ile kullanılan özgür olmayan donanım yazılımı (firmware) programları, &ldquo;blob’lar&rdquo; olarak adlandırılır ve bu terimi kullanırız. BSD tabirinde &ldquo;blob&rdquo; terimi başka bir şey ifade eder: özgür olmayan bir sürücü. OpenBSD ve diğer BSD dağıtımları (BSD geliştiricileri tarafından &ldquo;projeler (projects)&rdquo; olarak adlandırılır.), bunları içermeme politikasına sahiptir. Sürücüler açısından doğru politika budur: Ancak geliştiriciler bu dağıtımların &ldquo;blob içermediğini&rdquo; söylediğinde yanlış anlaşılmalara neden olur. Donanım yazılımı (firmware) blob'ları hakkında konuşmuyorlar.

source: None of those BSD distributions has policies against proprietary binary-only firmware that might be loaded even by free drivers.
tr: Bu BSD dağıtımlarının hiçbiri, özgür sürücüler tarafından bile yüklenebilecek olan sahipli ikili ürün yazılımlarına (proprietary binary-only firmware) yönelik politikalara sahip değildir.

source: The central part of Chrome OS is the nonfree Chrome browser. It may contain other nonfree software as well.
tr: Chrome OS’un merkezî kısmı, özgür olmayan Chrome tarayıcısıdır. Başka özgür olmayan yazılım da içerebilir.

source: The rest of it is based on <a href="#ChromiumOS">ChromiumOS</a>, so it also has the problems of Chromium OS, plus the nonfree parts of Android.
tr: Diğer kısımları <a href="#ChromiumOS">ChromiumOS</a>'da dayanıyor, bu nedenle Chromium OS'un ve Android'in özgür olmayan kısımlarının sorunlarını da barındırıyor.

source: Chromium OS contains proprietary software, including firmware blobs and nonfree user-space binaries to support specific hardware on some computers.
tr: Chromium OS, aygıt yazılımı parçaları ve bazı bilgisayarlarda belirli donanımı desteklemek için özgür olmayan kullanıcı alanı ikili dosyalarını da içeren, özel mülk yazılım içeriyor.
