Repository: GitMirroring/www-tr
Catalog: distros/common-distros.*.po
Languages: tr

source: In addition, the login system surveils users, as it requires a Google account (Chromium OS does not support local accounts). The &ldquo;guest&rdquo; session feature is not a real alternative to logging in with a Google account, because it doesn't allow persistent storage and limits the system's features.
tr: Ek olarak, oturum açma sistemi kullanıcıyı gözetliyor, çünkü bir Google hesabı gerektiriyor (Chromium OS yerel hesapları desteklemiyor). &ldquo;Misafir&rdquo; oturum özelliği Google hesabıyla oturum açmaya karşı ciddi bir alternatif oluşturmuyor, çünkü kalıcı saklamaya izin vermiyor ve sistemin bazı özelliklerini kısıtlıyor.

source: /e/ (formerly eelo) is a modified version of Android, which contains nonfree libraries.
tr: /e/ (eskiden eelo), özgür olmayan kütüphaneler içeren Android’in değiştirilmiş bir sürümüdür.

source: Graphene OS is a version of Android which is described as &ldquo;open source,&rdquo; but it seems to include software that <a href="/philosophy/open-source-misses-the-point.html"> isn't free software or even &ldquo;open source&rdquo;</a>. For instance, it comes with firmware programs for installation and it appears that at least some of them are binaries without source code. It is said to be &ldquo;de-Googled,&rdquo; but includes a way to download and install the nonfree Google Play program.
tr: Graphene OS, &ldquo;açık kaynak&rdquo; olarak tanımlanan bir Android sürümüdür, ancak <a href="/philosophy/open-source-misses-the-point.html">özgür yazılım ve hatta &ldquo;açık kaynak&rdquo; olmayan</a> yazılım içeriyor gibi gözüküyor. Örneğin, kurulmak üzere aygıt yazılımı programlarıyla geliyor ve en azından bunların bazıları kaynak kodu olmayan ikili dosyalar gibi. &ldquo;Google'dan arındırıldığı&rdquo; söylense de özgür olmayan Google Play programını indirmenin ve kurmanın bir yolunu da içeriyor.

source: Haiku includes some software that you're not allowed to modify. It also includes nonfree firmware blobs.
tr: Haiku, değiştirmenize izin verilmeyen bazı yazılımlar içerir. Ayrıca özgür olmayan donanım yazılımı blob’larını içerir.

source: LineageOS (formerly CyanogenMod) is a modified version of Android, which contains nonfree libraries. It also explains how to install the nonfree applications that Google distributes with Android.
tr: LineageOS (eskiden CyanogenMod), özgür olmayan kütüphaneler içeren Android’in değiştirilmiş bir sürümüdür. Ayrıca Google’nin Android ile dağıttığı özgür olmayan uygulamaların nasıl yükleneceğini de açıklar.

source: ReactOS is meant as a free binary compatible replacement for Windows. Use with proprietary software and drivers meant for Windows is one of the stated goals of the project.
tr: ReactOS; Windows için özgür, ikili, uyumlu bir ikame (a free binary compatible replacement) anlamına gelir. Özel mülk yazılım ve Windows için kullanılan sürücülerle kullanmak, projenin belirtilen hedeflerinden biridir.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
tr: Bu sayfa <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.tr">Creative Commons Alıntı-Türetilemez 4.0 Uluslararası Lisansı</a> altında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>The FLOSS Information <a href="mailto:theflossinformation@gmail.com">&lt;theflossinformation@gmail.com&gt;</a>, 2019, 2020.</li> </ul>

source: Updated:
tr: Son Güncelleme:
