Repository: GitMirroring/www-tr
Catalog: licenses/copyleft.*.po
Languages: tr

source: What is Copyleft? - GNU Project - Free Software Foundation
tr: Copyleft nedir? - GNU Projesi - Özgür Yazılım Vakfı

source: GNU, FSF, Free Software Foundation, Linux, Copyleft
tr: GNU, FSF, Özgür Yazılım Vakfı, Linux, Copyleft

source: What is Copyleft?
tr: Copyleft Nedir?

source: Copyleft is a general method for making a program (or other work) free (<a href="/philosophy/free-sw.html">in the sense of freedom, not &ldquo;zero price&rdquo;</a>), and requiring all modified and extended versions of the program to be free as well.
tr: Copyleft, bir programın (veya başka bir çalışmanın) <a href="/philosophy/free-sw.html">özgür yazılım</a> haline getirilmesi, programın tüm değiştirilmiş ve geliştirilmiş sürümlerinin de özgür yazılım olması için genel bir yöntemdir.

source: The simplest way to make a program free software is to put it in the <a href="/philosophy/categories.html#PublicDomainSoftware">public domain</a>, uncopyrighted. This allows people to share the program and their improvements, if they are so minded. But it also allows uncooperative people to convert the program into <a href="/philosophy/categories.html#ProprietarySoftware">proprietary software</a>. They can make changes, many or few, and distribute the result as a proprietary product. People who receive the program in that modified form do not have the freedom that the original author gave them; the middleman has stripped it away.
tr: Bir programı özgür hale getirmenin en basit yolu, telif hakkını kaldırıp programı <a href="/philosophy/categories.html#PublicDomainSoftware">kamu malı</a> haline getirmektir. Bu istekleri bu yöndeyse insanların programı ve iyileştirmeleri paylaşmalarını sağlar. Ancak bu durum ayrıca işbirliği yapmayan insanların programı <a href="/philosophy/categories.html#ProprietarySoftware">özel mülk yazılıma</a> dönüştürmesine de neden olur. Bu insanlar, çok sayıda ya da az sayıda değişiklik yapar ve programı özel mülk bir ürün olarak dağıtırlar. Programı bu değiştirilmiş biçimde alan insanlar, özgün yazarın onlara sağladığı özgürlüğe sahip olamazlar; aradaki insanlar bu özgürlüğü yoketmiştir.

source: In the <a href="/gnu/thegnuproject.html">GNU project</a>, our aim is to give <em>all</em> users the freedom to redistribute and change GNU software. If middlemen could strip off the freedom, our code might &ldquo;have many users,&rdquo; but it would not give them freedom. So instead of putting GNU software in the public domain, we &ldquo;copyleft&rdquo; it. Copyleft says that anyone who redistributes the software, with or without changes, must pass along the freedom to further copy and change it. Copyleft guarantees that every user has freedom.
tr: <a href="/gnu/thegnuproject.html">GNU Projesi</a>nde, hedefimiz, <em>tüm</em> kullanıcılara, GNU yazılımını yeniden dağıtmaları ve değiştirmeleri için özgürlük sağlamaktır. Aradaki insanlar özgürlüğü yok ederlerse, birçok kullanıcıya olabiliriz ama bu kullanıcıların özgürlüğü olmayacaktır. Bu nedenle, GNU yazılımını kamuya açık hale getirmek yerine, &ldquo;copyleft&rdquo; uygularız. Copyleft, değiştirsin veya değiştirmesin, yazılımı dağıtan kimsenin, yazılımı kopyalamak ve değiştirmek isteyen kimselere bu özgürlüğü aktarmaları gerektiğini söyler. Copyleft, her kullanıcının özgürlüğe sahip olmasını güvence altına alır.

source: Copyleft also provides an <a href="/philosophy/pragmatic.html">incentive</a> for other programmers to add to free software. Important free programs such as the GNU C++ compiler exist only because of this.
tr: Copyleft ayrıca diğer programcıların özgür yazılım eklemesi için bir <a href="/philosophy/pragmatic.html">güdü</a> de oluşturur. GNU C++ derleyicisi gibi önemli özgür programlar yalnızca bu nedenden dolayı varlar.

source: Copyleft also helps programmers who want to contribute <a href="/prep/tasks.html">improvements</a> to <a href="/philosophy/free-sw.html">free software</a> get permission to do so. These programmers often work for companies or universities that would do almost anything to get more money. A programmer may want to contribute her changes to the community, but her employer may want to turn the changes into a proprietary software product.
tr: Copyleft ayrıca geliştirdiği <a href="/prep/tasks.html">özellikleri</a> <a href="/philosophy/free-sw.html">özgür yazılım</a>a aktarmak isteyen programcıların bunu yapması için izin almalarına da yardımcı olmaktadır. Bu programcılar, daha fazla para kazanmak için hemen hemen her şeyi yapacak olan firmalar ya da üniversiteler için çalışmaktadır. Bir programcı, değişikliklerini kamuya aktarmak isteyebilir ancak işvereni, değişiklikleri özel mülk bir yazılım ürününe aktarmak isteyebilir.

source: When we explain to the employer that it is illegal to distribute the improved version except as free software, the employer usually decides to release it as free software rather than throw it away.
tr: İşverene, gelişmiş sürümün özgür yazılım hariç olmak üzere dağıtılmasının yasadışı olduğunu açıkladığımızda, işveren, genelde bu yazılımı çöpe atmak yerine özgür yazılım olarak dağıtmayı tercih etmektedir.

source: To copyleft a program, we first state that it is copyrighted; then we add distribution terms, which are a legal instrument that gives everyone the rights to use, modify, and redistribute the program's code, <em>or any program derived from it</em>, but only if the distribution terms are unchanged. Thus, the code and the freedoms become legally inseparable.
tr: Bir programı copyleft etmek için, ilk olarak telif hakkının olduğunu ifade ederiz; daha sonra yalnızca dağıtım terimleri değişmemişse, bu programdan elde edilen herhangi bir programın ya da bu program kodunun kullanım haklarının, değiştirme ve yeniden dağıtım haklarının herkese verildiği yasal bir araç olan dağıtım terimlerini ekleriz. Bu nedenle, kod ve özgürlükler yasal olarak ayrılamaz hale gelir.

source: Proprietary software developers use copyright to take away the users' freedom; we use copyright to guarantee their freedom. That's why we reverse the name, changing &ldquo;copyright&rdquo; into &ldquo;copyleft.&rdquo;
tr: Özel mülk yazılım geliştiricileri, telif hakkını kullanıcıların özgürlüğünü almak için kullanmaktadır; biz ise telif hakkını kullanıcıların özgürlüğünü garanti etmek için kullanmaktayız. İsmini, “telif hakkı”ndan [:copyright] “copyleft”’e çevirmemizin nedeni budur.

source: Copyleft is a way of using the copyright on the program. It doesn't mean abandoning the copyright; in fact, doing so would make copyleft impossible. The &ldquo;left&rdquo; in &ldquo;copyleft&rdquo; is not a reference to the verb &ldquo;to leave&rdquo;&mdash;only to the direction which is the mirror image of &ldquo;right&rdquo;.
tr: Copyleft program üzerinde telif hakkını kullanmanın bir yoldur. Telif hakkından vazgeçmek anlamına gelmez; gerçekte, telif hakkından vazgeçmek copylefti imkansızlaştıracaktır. Copyleft kelimesindeki “left” ifadesi; İngilizce'deki “to leave” (terketmek, bırakmak) fiiline bir atıf değildir; sadece “right” yönünün tersi yönünü temsil etmektedir.

source: Copyleft is a general concept, and you can't use a general concept directly; you can only use a specific implementation of the concept. In the GNU Project, the specific distribution terms that we use for most software are contained in the <a href="/licenses/gpl.html"> GNU General Public License</a>. The GNU General Public License is often called the GNU GPL for short. There is also a <a href="/licenses/gpl-faq.html">Frequently Asked Questions</a> page about the GNU GPL. You can also read about <a href="/licenses/why-assign.html">why the FSF gets copyright assignments from contributors</a>.
tr: Copyleft genel bir kavramdır; ayrıntıları doldurmanın çeşitli yolları vardır. GNU Projesinde, kullandığımız özel dağıtım terimleri, <a href="/licenses/gpl.html">GNU Genel Kamu Lisansı</a>'nda biçimlerinde erişebilirsiniz) mevcuttur. GNU Genel Kamu Lisansı sıklıkla kısaca GNU GPL olarak adlandırılır. Ayrıca İnternette GNU GPL hakkında <a href="/licenses/gpl-faq.html">Sıklıkla Sorulan Sorular sayfası</a> var. Ek olarak FSF’nin <a href="/licenses/why-assign.html">katılımcılardan gelen telif hakkı görevlerini niçin aldığına</a> ilişkin bilgileri de okuyabilirsiniz.

source: An alternate form of copyleft, the <a href="/licenses/agpl.html">GNU Affero General Public License (AGPL)</a> is designed for programs that are likely to be used on servers. It ensures that modified versions used to implement services available to the public are released as source code to the public.
tr: Alternatif bir copyleft biçimi olan <a href="/licenses/agpl.html">GNU Affero Genel Kamu Lisansı (AGPL)</a> sunucularda kullanılma ihtimali olan programlar için tasarlanmıştır. Kamuya açık hizmetleri gerçekleştirmek için kullanılan değiştirilmiş sürümlerin açık kaynak kod olarak kamuya yayınlanmasını güvence altına alır.

source: A compromise form of copyleft, the <a href="/licenses/lgpl.html">GNU Lesser General Public License (LGPL)</a> applies to a few (but not all) GNU libraries. To learn more about properly using the LGPL, please read the article <a href="/philosophy/why-not-lgpl.html"><cite>Why you shouldn't use the Lesser GPL for your next library</cite></a>.
tr: Alternatif bir copyleft biçimi olan <a href="/licenses/lgpl.html">GNU Kısıtlı Genel Kamu Lisansı (LGPL)</a> bazı (ama hepsi değil) GNU kütüphanelerine uygulanmaktadır. LGPL'i uygun kullanmak için daha fazlasını öğrenmek üzere, lütfen <a href="/philosophy/why-not-lgpl.html"><cite>Neden bir sonraki kütüphaneniz için Lesser GPL kullanmamalısınız</cite></a> yazısını okuyun.

source: The <a href="/licenses/fdl.html">GNU Free Documentation License (FDL)</a> is a form of copyleft intended for use on a manual, textbook or other document to assure everyone the effective freedom to copy and redistribute it, with or without modifications, either commercially or noncommercially.
tr: <a href="/licenses/fdl.html">GNU Özgür Belgeleme Lisansı (FDL)</a> değiştirilmiş ya da değiştirilmemiş ticari olan ya da olmayan biçimde herkese kopyalama ve yeniden dağıtma etkili özgürlüğünü sağlamak için bir kılavuzda, kitapta ya da başka bir belgede kullanılması hedeflenen bir copyleft biçimidir.

source: The appropriate license is included in many manuals and in each GNU source code distribution.
tr: Uygun lisans bir çok rehberde, ve her bir GNU kaynak kodu dağıtımında içerilmiştir.

source: All these licenses are designed so that you can easily apply them to your own works, assuming you are the copyright holder. You don't have to modify the license to do this, just include a copy of the license in the work, and add notices in the source files that refer properly to the license.
tr: Bütün bu lisanslar kendi çalışmalarınıza, sizin telif hakkı sahibi olduğunuz varsayımıyla, rahatlıkla uyarlayabileceğiniz şekilde tasarlanmıştır. Uyarlama için lisansları değiştirmenize gerek yoktur, sadece çalışmada lisansın bir kopyasını barındırmanız, ve kaynak kodlarda uygun bir şekilde lisansa yönelik bildirimleri eklemeniz yeterlidir.

source: Using the same distribution terms for many different programs makes it easy to copy code between various different programs. When they all have the same distribution terms, there is no problem. The Lesser GPL, version 2, includes a provision that lets you alter the distribution terms to the ordinary GPL, so that you can copy code into another program covered by the GPL. Version 3 of the Lesser GPL is built as an exception added to GPL version 3, making the compatibility automatic.
tr: Birçok farklı program için aynı dağıtım terimlerinin kullanılması, çeşitli farklı programlar arasında kodun kopyalanmasını kolaylaştırmaktadır. Tümü aynı dağıtım terimlerine sahip oldukları için, terimlerin uyumlu olup olmadığının düşünülmesine gerek yoktur. Kısıtlı GPL, sürüm 2, dağıtım terimlerini genel GPL olarak değiştirmenize izin veren bir eklemeyi içerir, böylece kodu, GPL tarafından kapsanan başka bir programa kopyalayabilirsiniz. Lesser GPL'nin sürüm 3'ü, GPL sürüm 3'e bir istisna olarak eklenmiştir, uyumluluk böylece otomatikleşmiştir.

source: If you would like to copyleft your program with the GNU GPL or the GNU LGPL, please see the <a href="/licenses/gpl-howto.html">license instructions page</a> for advice. Please note that you must use the entire text of the license you choose. Each is an integral whole, and partial copies are not permitted.
tr: Eğer programınızı GNU GPL veya GNU LGPL ile copyleft yapmak istiyorsanız, lütfen <a href="/licenses/gpl-howto.html">lisans açıklamaları sayfasını </a> tavsiyeler için ziyaret edin. Seçtiğiniz lisansın tüm metnini kullanmanız gerektiğini unutmöayın. Her biri bütündür, ve kısmi kopyalara izin verilmemektedir.

source: If you would like to copyleft your manual with the GNU FDL, please see the instructions at the <a href="/licenses/fdl.html#addendum">end</a> of the FDL text, and the <a href="/licenses/fdl-howto.html">GFDL instructions page</a>. Again, partial copies are not permitted.
tr: Eğer kılavuzunuzu GNU FDL ile copyleft yapmak isterseniz, lütfen FDL metninin<a href="/licenses/fdl.html#addendum">sonundaki</a> yönergeleri, ve <a href="/licenses/fdl-howto.html">GFDL açıklamalar sayfasını</a> inceleyin. Tekrar, kısmi kopyalara izin verilmemektedir.

source: It is a legal mistake to use a backwards C in a circle instead of a copyright symbol. Copyleft is based legally on copyright, so the work should have a copyright notice. A copyright notice requires either the copyright symbol (a C in a circle) or the word &ldquo;Copyright&rdquo;.
tr: Telif hakkı simgesi yerine bir çember içerisinde ters C kullanmak yasal bir hatadır. Copyleft yasal olarak telif hakkına (copyright) dayanmaktadır, dolayısıyla çalışmanın telif hakkı ibaresi olmalıdır. Bir telif hakkı ibaresinin ya telif hakkı simgesini (çember içinde C) veya &ldquo;Copyright&rdquo; kelimesini içermesi gereklidir.

source: A backwards C in a circle has no special legal significance, so it doesn't make a copyright notice. It may be amusing in book covers, posters, and such, but <a href="https://en.wikipedia.org/wiki/Copyleft#Symbol"> be careful how you represent it in a web page!</a>
tr: Çember içerisinde ters C'nin herhangi bir yasal önemi yoktur, dolayısıyla bir telif hakkı ibaresi değildir. Kitap kapaklarında, posterlerde, vb. durumlarda eğlenceli olabilir ama <a href="https://en.wikipedia.org/wiki/Copyleft#Symbol">web sayfanızda onu nasıl temsil ettiğiniz konusunda dikkatli olun!</a>

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilir.

source: Copyright &copy; 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2014, 2015, 2016, 2017, 2018 Free Software Foundation, Inc.
tr: Copyright &copy; 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2014, 2015, 2016, 2017, 2018 Özgür Yazılım Vakfı Software Foundation, Inc.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
tr: Bu sayfa a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.tr">Creative Commons Attribution-NoDerivatives 4.0 International License</a> ile lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>The FLOSS Information &lt;theflossinformation@yandex.com&gt;, 2019.</li> <li>T. E. Kalayci 2019, 2009.</li> <li>Çiğdem Özşar, 2009.</li> <li>Birkan Sarıfakıoğlu, 2009.</li> <li>Serkan Çapkan, 2009.</li> <li>İzlem Gözükeleş, 2009.</li> </ul>

source: Updated:
tr: Son Güncelleme:
