Repository: GitMirroring/www-tr
Catalog: licenses/gpl-3.0.*.po
Languages: tr

source: The GNU General Public License v3.0 - GNU Project - Free Software Foundation
tr: GNU Genel Kamu Lisansı v3.0 - GNU Projesi - Özgür Yazılım Vakfı

source: GNU General Public License
tr: GNU Genel Kamu Lisansı

source: [GPLv3 Logo]
tr: [GPLv3 Logosu]

source: <b><a href="#license-text">Skip to license text</a></b>
tr: <b><a href="#license-text">Lisans metnine atla</a></b>

source: <a href="/licenses/quick-guide-gplv3.html">A Quick Guide to GPLv3</a>
tr: <a href="/licenses/quick-guide-gplv3.html">GPLv3 İçin Hızlı Bir Kılavuz</a>

source: <a href="/licenses/rms-why-gplv3.html">Why Upgrade to GPLv3</a>
tr: <a href="/licenses/rms-why-gplv3.html">Neden GPLv3'e Yükseltilmeli</a>

source: <a href="/licenses/gpl-faq.html">Frequently Asked Questions about the GNU licenses</a>
tr: <a href="/licenses/gpl-faq.html">GNU lisansları hakkında Sıkça Sorulan Sorular</a>

source: <a href="/licenses/gpl-howto.html">How to use GNU licenses for your own software</a>
tr: <a href="/licenses/gpl-howto.html">GNU lisanslarını kendi yazılımınız için nasıl kullanabilirsiniz</a>

source: <a href="/licenses/translations.html">Translations of the GPL</a>
tr: <a href="/licenses/translations.html">GPL'nin Çevirileri</a>

source: The GPL in other formats: <a href="/licenses/gpl-3.0.txt">plain text</a>, <a href="/licenses/gpl-3.0.texi">Texinfo</a>, <a href="/licenses/gpl-3.0.tex">LaTeX</a>, <a href="/licenses/gpl-3.0-standalone.html">standalone HTML</a>, <a href="/licenses/gpl-3.0.odt">ODF</a>, Docbook <a href="/licenses/gpl-3.0.dbk">v4</a> or <a href="/licenses/gpl-3.0.xml">v5</a>, <a href="/licenses/gpl-3.0.rst">reStructuredText</a>, <a href="/licenses/gpl-3.0.md">Markdown</a>, and <a href="/licenses/gpl-3.0.rtf">RTF</a>.
tr: Diğer biçimlerde GPL: <a href="/licenses/gpl-3.0.txt">düz metin</a>, <a href="/licenses/gpl-3.0.texi">Texinfo</a>, <a href="/licenses/gpl-3.0.tex">LaTeX</a>, <a href="/licenses/gpl-3.0-standalone.html">tek HTML</a>, <a href="/licenses/gpl-3.0.odt">ODF</a>, Docbook <a href="/licenses/gpl-3.0.dbk">v4</a> veya <a href="/licenses/gpl-3.0.xml">v5</a>, <a href="/licenses/gpl-3.0.rst">reStructuredText</a>, <a href="/licenses/gpl-3.0.md">Markdown</a> ve <a href="/licenses/gpl-3.0.rtf">RTF</a>.

source: <a href="/graphics/license-logos.html">GPLv3 logos</a> to use with your project
tr: Projenizde kullanmanız için <a href="/graphics/license-logos.html">GPLv3 logoları</a>

source: <a href="/licenses/old-licenses/old-licenses.html#GPL">Old versions of the GNU GPL</a>
tr: <a href="/licenses/old-licenses/old-licenses.html#GPL">GNU GPL'nin eski sürümleri</a>

source: <a href="/licenses/gpl-violation.html">What to do if you see a possible GPL violation</a>
tr: <a href="/licenses/gpl-violation.html">Olası bir GPL ihlali görürseniz ne yapmalısınız</a>

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: Copyright notice above.
tr: Telif hakkı bildirimi yukarıdadır.

source: Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.
tr: Herkes bu lisans belgesinin birebir kopyalarını kopyalama ve dağıtma hakkında sahiptir ancak değiştirilemez.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>The FLOSS Information <a href="mailto:theflossinformation@gmail.com">&lt;theflossinformation@gmail.com&gt;</a>, 2020.</li> </ul>

source: Updated:
tr: Son Güncelleme:
