Repository: GitMirroring/www-tr
Catalog: licenses/gplv3-the-program.*.po
Languages: tr

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
tr: <p><a id="tn1">[1]</a> GPLv2 alıntılarının çevirisi <a href="https://ozgurlisanslar.org.tr/gpl/gpl-v2/">gayriresmi çeviriden</a> alınmıştır. Yasal olarak, bu lisansı kullanan programların dağıtım şartlarını lisansın <a href="https://www.gnu.org/licenses/old-licenses/gpl-2.0.html">özgün İngilizce sürümü</a> belirliyor. </p> <p><a id="tn2">[2]</a> GPLv3 alıntılarının çevirisi <a href="https://ozgurlisanslar.org.tr/gpl/gpl-v3/">gayriresmi çeviriden</a> alınmıştır. Yasal olarak, bu lisansı kullanan programların dağıtım şartlarını lisansın <a href="https://www.gnu.org/licenses/gpl-3.0.html">özgün İngilizce sürümü</a> belirliyor. </p>

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
tr: Bu sayfa <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.tr">Creative Commons Atıf-Türetilemez 3.0 Birleşik Devletler Lisansı</a> altında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>T. E. Kalaycı, 2021.</li> </ul>

source: Updated:
tr: Son Güncelleme:
