Repository: GitMirroring/www-tr
Catalog: licenses/gplv3-the-program.*.po
Languages: tr

source: What does &quot;the Program&quot; mean in GPLv3? - GNU Project - Free Software Foundation
tr: GPLv3'te &quot;Program&quot; ne anlama geliyor? - GNU Projesi - Özgür Yazılım Vakfı

source: What does &quot;the Program&quot; mean in GPLv3?
tr: GPLv3'te &quot;Program&quot; ne anlama geliyor?

source: Summary
tr: Özet

source: In version 3 of the GNU General Public License (GPLv3), the term &quot;the Program&quot; means one particular work that is licensed under GPLv3 and is received by a particular licensee from an upstream licensor or distributor. The Program is the particular work of software that you received in a given instance of GPLv3 licensing, as you received it.
tr: GNU Genel Kamu Lisansı (GPL) 3. sürümünde (GPLv3) &quot;Program&quot; terimi GPLv3 altında lisanslanmış olan ve belirli bir üst lisans veren veya dağıtıcıdan edinilmiş olan belirli bir çalışmayı kasteder. Program, verili GPLv3 lisanslama örneğinde edinmiş olduğunuz, almış olduğunuz haliyle bu belirli yazılım çalışmasıdır.

source: &quot;The Program&quot; cannot mean &quot;all the works ever licensed under GPLv3&quot;; that interpretation makes no sense, because &quot;the Program&quot; is singular: those many different programs do not constitute one program.
tr: &quot;Program&quot;, &quot;şimdiye kadar GPLv3 altında lisanslanmış tüm çalışmalar&quot; anlamına gelemez; bu yorumlama anlamsızdır, çünkü &quot;Program&quot; tekildir: birçok farklı program tek bir program oluşturmaz.

source: In particular, this applies to the clause in section 10, paragraph 3 of GPLv3 which states
tr: Özellikle bu durum GPLv3'ün 10. bölümündeki aşağıdakini ifade eden madde için geçerlidir

source: [Y]ou may not initiate litigation (including a cross-claim or counterclaim in a lawsuit) alleging that any patent claim is infringed by making, using, selling, offering for sale, or importing the Program or any portion of it.
tr: [Y]ou may not initiate litigation (including a cross-claim or counterclaim in a lawsuit) alleging that any patent claim is infringed by making, using, selling, offering for sale, or importing the Program or any portion of it. [herhangi bir patent hakkı iddiasının, Programı ya da herhangi bir bölümünü yaratmak, kullanmak, satmak, satmayı teklif etmek, ya da içe aktarmak yoluyla ihlal edildiğini öne sürerek (dava süresince karşı talepte bulunmak ya da karşı dava açmak da dahil olmak üzere) dava açma girişiminde bulunamazsınız.]

source: This is a condition that limits the ability of a GPLv3 licensee to bring a lawsuit accusing the particular GPLv3-covered software received by the licensee of patent infringement. It does not speak to the situation in which a party who is a licensee of GPLv3-covered program A, but not of unrelated GPLv3-covered program B, initiates litigation accusing program B of patent infringement. If the party is a licensee of both A and B, that party would potentially lose rights to B, but not to A.
tr: Bu koşul, GPLv3 lisans sahibi birinin, patent ihlali lisans sahibinin edinmiş olduğu belirli bir GPLv3 kapsamındaki yazılımı suçlayan bir dava açma kabiliyetini sınırlandıran bir koşuldur. GPLv3 kapsamındaki program A'nın lisansına sahip olan ama ilişkisiz GPLv3 kapsamındaki program B'nin lisansına sahip olmayan tarafın, program B'yi patent ihlali ile suçlayan bir dava başlatmasından söz etmiyor. Eğer ilgili taraf, hem A hem de B'nin lisansına sahip olsaydı, bu taraf potansiyel olarak B'nin haklarını kaybedebilirdi, ama A'nınkileri kaybetmezdi.

source: Since software patents pose an unjust threat to all software developers, all software distributors, and all software users, we would abolish them if we could. Indeed, we campaign to do so. But we think it would have been self-defeating to make the license conditions for any one GPL-covered program go so far as to require a promise to never attack any GPL-covered program.
tr: Yazılım patentleri tüm yazılım geliştiricilere, tüm yazılım dağıtımcılarına ve tüm yazılım kullanıcılarına yönelik haksız bir tehdit oluşturduğundan, eğer yapabiliyorsak tüm patentleri yürürlükten kaldırmalıyız. Elbette bunun için bir kampanyaya ihtiyacımız var. Ancak herhangi bir GPL kapsamındaki programın lisans koşullarını, GPL kapsamındaki hiçbir programa saldırmama sözünü talep edecek kadar belirlememiz, başarısızlığa yol açacaktır.

source: Further analysis
tr: Kapsamlı Çözümleme

source: GPLv3 defines &quot;the Program&quot; as follows:
tr: GPLv3 &quot;Program&quot;'ı şu şekilde tanımlar:

source: &quot;The Program&quot; refers to any copyrightable work licensed under this License.
tr: &quot;Program&quot;, işbu Lisans altında lisanslanmış her türlü telif hakkı kapsamına alınabilecek çalışmayı kasteder.

source: Some have contended that this definition can be read to mean all GPLv3-licensed works, rather than the one particular GPLv3-licensed work received by a licensee in a given licensing context. These readers have expressed particular concern about the consequences of such an interpretation for the new patent provisions of GPLv3, especially the patent termination condition found in the third paragraph 10 and the express patent license grant made by upstream contributors under the third paragraph of section 11. This overbroad reading of &quot;the Program&quot; is incorrect, and contrary to our intent as the drafters of GPLv3.
tr: Kimileri bu tanımın, verili bir lisans bağlamında, bir lisans sahibi tarafından edinilen tek bir belirli GPLv3 lisanslı çalışmadan ziyade tüm GPLv3 lisanslı çalışmalar anlamına gelecek şekilde anlaşıldığını öne sürdüler. Bu okurlar, GPLv3'teki bu gibi yeni patent hükümlerinin, özellikle de 10. bölümün 3. paragrafında bulunan patent iptali koşulu ve 11. bölümün 3. paragrafının altındaki üst projeye katkı sağlayanlarca yapılan hızlı patent lisansı verilmesinin, sonuçları hakkında kaygılara sahipler. &quot;Program&quot; hakkındaki bu yüzeysel okuma yanlıştır ve GPLv3'ün taslağını hazırlayanlar olarak niyetlerimizle karşıttır.

source: The word &quot;any&quot; is susceptible to multiple, subtly different shades of meaning in English. In some contexts, &quot;any&quot; means &quot;every&quot; or &quot;all&quot;; in others, including the definition of &quot;the Program&quot; in GPLv3, it suggests &quot;one particular instance of, selected from many possibilities&quot;. This variability has to be resolved by the context. This context resolves it, but it requires some thought.
tr: İngilizce'de &quot;any&quot; sözcüğü zor ayırt edilebilir şekilde pek çok farklı anlama gelebilir. Bazı bağlamlarda &quot;any&quot; sözcüğü &quot;hepsi&quot; veya &quot;tümü&quot; anlamındadır; başka bağlamlarda, GPLv3'teki &quot;Program&quot; tanımında olduğu gibi, &quot;birçok olasılıktan seçilmiş tek bir belirli örneği&quot; kasteder. Bu değişkenlik bağlama bakarak çözülmelidir. Bu bağlamda anlaşılıyor, ancak biraz düşünmeyi gerektiriyor.

source: We could have worded the definition of &quot;the Program&quot; differently, such as by using &quot;a particular&quot; instead of &quot;any&quot;, but that would not have eliminated the need for thought. The phrase &quot;a particular work licensed under this License&quot;, regarded in isolation, would not necessarily signify *the* particular work received by a particular &quot;you&quot; in a particular act of licensing or distribution. Our review of other free software licenses shows that they raise similar issues of interpretation, with words of general reference used in order to facilitate license reuse.
tr: &quot;Program&quot; tanımını farklı sözcüklerle yazabilirdik, örneğin &quot;any&quot; yerine &quot;particular&quot; [belirli] kullanabilirdik, ancak bu düşünme ihtiyacını ortadan kaldırırdı. &quot;Bu Lisans altında lisanslanmış olan belirli bir çalışma&quot; ifadesi, yalıtılmış bir şekilde hesaba katılıyor, mutlaka belirli bir lisanslama veya dağıtım eylemi içerisindeki, belirli bir &quot;siz&quot; tarafından edinilmiş olan belirli *bir* çalışmaya işaret etmek zorunda değildir.

source: Given that no choice is so clear that all other candidate meanings must be rejected, &quot;any&quot; has certain advantages. It is a somewhat more informal and less legalistic usage than the possible alternatives, an appropriate register for the developers reading and applying the license. Moreover, the usage of &quot;any&quot;, through its suggestion of selection out of many qualifying possibilities, has the effect of emphasizing the reusability of GPLv3 for multiple works of software and in multiple licensing situations. The GNU GPL is intended to be used by many developers on their programs and that too needs to be clear.
tr: Hiç bir seçenek, diğer tüm aday anlamları eleyecek kadar yeterince açık olmadığı için, &quot;any&quot; sözcüğünün belirgin bir avantajı var. Olası alternatiflere göre bir bakıma çok daha gayriresmi ve daha az yasal bir kullanım, lisansı okuyan ve uygulayan geliştiriciler için uygun bir kayıt. Üstelik &quot;any&quot;, birçok uygun olasılıktan seçilmek üzere önerilmesiyle, GPLv3'ün birçok yazılım çalışması ve birçok lisanslama durumunda yeniden kullanılabilirliğini vurgulama etkisine de sahip. GNU GPL, birçok geliştirici tarafından programlarında kullanılsın amacıyla var ve bunun da açık olması gerekiyor.

source: The same use of &quot;any&quot; that has given rise to interpretive concerns under GPLv3 exists in GPLv2, in its corresponding definition. Section 0 of GPLv2 states:
tr: GPLv3 içerisinde yorumlamaya ilişkin kaygılara yol açan bu &quot;any&quot; kullanımının aynısı, GPLv2'deki karşılık gelen tanımda da var. GPLv2'nin 0. bölümü şöyle diyor:

source: This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License. The &quot;Program&quot;, below, refers to any such program or work, and a &quot;work based on the Program&quot; means either the Program or any derivative work under copyright law &hellip;
tr: This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License. The &quot;Program&quot;, below, refers to any such program or work, and a &quot;work based on the Program&quot; means either the Program or any derivative work under copyright law &hellip; [İşbu lisans, telif hakkı sahibi tarafından bu Genel Kamu Lisansı hükümleri altında dağıtılabileceğini belirten bir uyarı içeren her türlü program ve diğer çalışmalara uygulanır. Aşağıda bahsi geçen &quot;Program&quot;, bu tür program ya da çalışmayı kastetmekte olup, &quot;programa dayalı çalışma&quot; telif hakkı yasası altındaki program ya da türevi çalışma anlamına gelir&hellip;<a href="#tn1">[1]</a>]

source: However, it has always been the understanding of the FSF and others in the GPL-using community that &quot;the Program&quot; in GPLv2 means the particular GPL-covered work that you receive, before you make any possible modifications to it. The definition of &quot;the Program&quot; in GPLv3 is intended to preserve this meaning.
tr: Bununla birlikte, FSF'nin ve GPL kullanan topluluktaki diğer kişilerin GPLv2'deki &quot;Program&quot; kavrayışı her zaman, ona herhangi bir değişiklik yapmanızdan önceki, edindiğiniz belirli bir GPL kapsamındaki çalışma şeklindeydi. GPLv3'teki &quot;Program&quot; tanımı da bu anlamı korumayı amaçlıyor.

source: We can find no clause in GPLv3 in which applying the suggested broad interpretation of &quot;the Program&quot; (and the superset term &quot;covered work&quot;) would make sense or have any practical significance, consistent with the wording of the clause and its drafting history. The patent provisions of GPLv3 are a case in point.
tr: GPLv3'te, &quot;Program&quot;ın (ve üst kümesi olan &quot;korunmuş çalışma&quot; teriminin) önerilen geniş yorumunu uygulamakla, maddenin üslubu ve yazım geçmişiyle tutarlı, herhangi anlam veya pratik bir önem yaratacak bir madde bulamıyoruz. GPLv3'teki patent hükümleri tipik bir örnek.

source: The third paragraph of section 11 states:
tr: 11. bölümdeki üçüncü paragraf şunu ifade ediyor:

source: Each contributor grants you a non-exclusive, worldwide, royalty-free patent license under the contributor's essential patent claims, to make, use, sell, offer for sale, import and otherwise run, modify and propagate the contents of its contributor version.
tr: Each contributor grants you a non-exclusive, worldwide, royalty-free patent license under the contributor's essential patent claims, to make, use, sell, offer for sale, import and otherwise run, modify and propagate the contents of its contributor version. [Her katkı sağlayıcı; temel patent istemleri altında, katkı sağlayanın sürümünün içeriğini yaratma, kullanma, satma, satmayı teklif etme, içe aktarma ya da ayrıca değiştirme ve yayma lisansını; tam yetki vermeyen, dünya çapında, telifsiz patent lisansı şeklinde verir.<a href="#tn2">[2]</a>]

source: A &quot;contributor&quot; is defined as &quot;a copyright holder who authorizes use under this License of the Program or a work on which the Program is based.&quot;
tr: Bir &quot;katkıda bulunan&quot; şu şekilde tanımlanmıştır: &quot;işbu lisans altında programa ya da programa bağlı bir ürünün kullanımına izin veren telif hakkı sahibi&quot;

source: The broad reading of &quot;the Program&quot;, it has been suggested, gives rise to an unreasonably broad patent license grant. The reasoning is that, for a given GPLv3 licensee, the set of contributors granting patent licenses becomes all GPLv3 licensors of all GPLv3-covered works in the world, and not merely licensors of the specific work received by that licensee in a particular act of licensing.
tr: &quot;Program&quot;ı önerilen şekilde geniş yorumlanması, mantıksızca geniş bir patent lisansı tahsisine neden olur. Bundaki akıl yürütme, verili bir GPLv3 lisans sahibi için, patent lisanslarını tahsis eden birtakım katkı sağlayanlar, dünyadaki tüm GPLv3 kapsamındaki çalışmaların GPLv3 lisans verenleri haline gelir, salt belirli bir lisanslama eylemindeki bu lisans sahibince edinilen belirli bir çalışmanın lisans verenleri olarak değil.

source: Close attention to the wording of the patent license grant, however, shows that these concerns are unfounded. In order to exercise the permissions of the patent license grant, a GPLv3 licensee must have &quot;the contents of [the contributor's] contributor version&quot; in his possession. If he does, then he is necessarily a recipient of that material, licensed to him under GPLv3.
tr: Şu var ki patent lisansı vermenin cümle yapısına pür dikkatle baktığımızda, bu kaygıların temelsiz olduğunu görürüz. Patent lisansını verme izinlerini uygulayabilmek için, bir GPLv3 lisans sahibi, &quot;[katkı sağlayanın] katkı sağladığı sürümün içeriğine&quot; sahip olmalıdır. Eğer sahipse, muhakkak, kendisine GPLv3 altında lisanslanmış bu malzemenin bir alıcısıdır.

source: Therefore, contributors are always the actual copyright licensors of the material that is the subject of the patent license grant. The user benefiting from the patent license grant has ultimately received the material covered by the grant from those contributors. If it were otherwise, the patent license grant would be meaningless, because the exercise of its permissions is tied to the contributor's &quot;contributor version&quot;. The contributors and the section 11 patent licensee stand in a direct or indirect distribution relationship. Therefore, section 11, paragraph 3 does not require you to grant a patent license to anyone who is not also your copyright licensee. (Non-contributor redistributors remain subject to applicable implied patent license doctrine and to the special &quot;automatic extension&quot; provision of section 11, paragraph 6.)
tr: Bu yüzden, katkı sağlayanlar, her zaman, patent lisansını vermenin konusu olan malzemenin fiili telif hakkı lisansını verenlerdir. Patent lisansı verilmesinden yarar sağlayan kullanıcı, sonuç olarak bu katkı sağlayanların verdiğinin kapsamındaki malzemeyi edinmişlerdir. Aksi durumda olsaydı, patent lisansının verilmesi anlamsız olacaktı, çünkü izinlerinin uygulanması, katkı sağlayanların &quot;katkı sağlayanın sürümü&quot;ne tabidir. Katkı sağlayanlar ve 11. bölümdeki patent lisansını verenler doğrudan ve dolaylı bir dağıtım ilişkisinde bulunuyorlar. Bu nedenle, 11. bölüm 3. paragraf telif hakkı lisansına sahip olmayan herhangi birine patent lisansını vermenizi istemiyor. (Katkı sağlayan olmayanlarca yeniden dağıtım ima edilen patent lisansı ilkesi ve 11. bölüm 6. paragraftaki &quot;kendiliğinden uzatma&quot; hükmüne tabi kalmaya devam ediyor.)

source: There is similarly no basis for the broad reading of &quot;the Program&quot; when one considers the patent-related clause in the third paragraph of section 10. This clause provides:
tr: Birisi 10. bölümün üçüncü paragrafındaki patentle ilişkili maddeyi ele aldığında, &quot;Program&quot; tanımını genişçe anlamasının benzer bir şekilde temeli yoktur. Bu madde şunu sağlar:

source: Coupled with the patent license grant of section 11, paragraph 3, and the termination clause of section 8, this section 10 clause gives rise to a patent termination condition similar in scope to that contained in the Apache License version 2.0.
tr: 11. bölüm, 3. paragraftaki patent lisansını verme ve 8. bölümdeki iptal maddesiyle bağlantılı olarak bu 10. bölüm maddesi, Apache Lisansı sürüm 2.0'da yer alanla benzer kapsamda bir patent iptali koşuluna yol açar.

source: The FSF sympathizes with the intent of broad patent retaliation clauses in some free software licenses, since the abolition of software patents is greatly to be desired. However, we think that broad patent retaliation provisions in software licenses are unlikely to benefit the community, especially those clauses which can be triggered by patent litigation concerning other programs unrelated to the software whose license permissions are being terminated. We were very cautious in taking steps to incorporate patent retaliation into GPLv3, and the section 10, paragraph 3 clause is intended to be narrower than patent retaliation clauses in several other well-known licenses, notably the Mozilla Public License version 1.1, with respect to termination of patent licenses.
tr: FSF, bazı özgür yazılım lisanslarındaki geniş patent missileme maddelerinin amaçlarıyla yakınlık duyar, çünkü yazılım patentlerinin ortadan kaldırılması fazlasıyla arzulanan bir şey. Bununla birlikte, yazılım lisanslarındaki patent missileme hükümlerinin topluluğa yarar vermekten uzak olduğunu düşünüyoruz, özellikle de, lisans izinleri iptal edilen yazılımla alakasız diğer programlara ilişkin patent davasıyla tetiklenebilecek maddelerin. GPLv3 içerisine patent misillemeyi eklemeye yönelik adımlar atarken çok dikkatliydik ve 10. bölüm 3. paragraftaki madde, diğer iyi bilinen birçok lisanstaki, özellikle Mozilla Kamu Lisansı sürüm 1.1'deki, patent misillemelerine göre, patent lisanslarının iptali bakımından daha dar olacak şekilde tasarlandı.

source: If the suggested interpretation of &quot;the Program&quot; applied to the section 10, paragraph 3 clause, the result would be a radical departure from our consistent past statements and policies concerning patent retaliation, which we clearly did not intend.
tr: Eğer önerilen &quot;Program&quot; yorumu 10. bölüm 3. paragraftaki maddeye uygulanırsa, sonuç, patent misillemesine ilişkin geçmişteki tutarlı beyanlarımızı ve politikalarımızı, açıkça hiç de niyetlenmediğimiz halde, köklü bir şekilde terk etmek olurdu.

source: Other text in GPL version 3 shows the same policy. The patent litigation clause in section 10 was added to Draft 3 of GPLv3 as a replacement for part of the previous clause 7(b)(5) (in Draft 2). Clause 7(b)(5) permitted the placement of two categories of patent termination provisions on GPLv3-licensed works:
tr: GPL sürüm 3'teki diğer metinler de aynı politikayı dışa vuruyor. 10. bölümdeki patent davası maddesi, GPLv3'ün (2. taslaktaki) önceki 7(b)(5) maddesinin yerine 3. taslağına eklenmişti. 7(b)(5) maddesi GPLv3 lisanslı çalışmara iki patent iptali koşulu kategorisini eklemeye izin veriyordu:

source: terms that wholly or partially terminate, or allow termination of, permission for use of the material they cover, for a user who files a software patent lawsuit (that is, a lawsuit alleging that some software infringes a patent) not filed in retaliation or defense against the earlier filing of another software patent lawsuit, or in which the allegedly infringing software includes some of the covered material, possibly in combination with other software &hellip;
tr: terms that wholly or partially terminate, or allow termination of, permission for use of the material they cover, for a user who files a software patent lawsuit (that is, a lawsuit alleging that some software infringes a patent) not filed in retaliation or defense against the earlier filing of another software patent lawsuit, or in which the allegedly infringing software includes some of the covered material, possibly in combination with other software &hellip; [sözde ihlal eden yazılımın, muhtemelen başka yazılımlarla birlikte, kapsanmış malzemeyi içeren veya başka bir yazılım patent davasına karşı savunma veya misilleme amacıyla açılmamış olan yazılım patent davası (yani bir yazılımın bir patenti ihlal ettiğini iddia eden bir dava) açan bir kullanıcı için kapsadıkları malzemenin kullanım iznini tamamen veya kısmen iptal eden veya iptaline izin veren şartlar &hellip;]

source: Section 7 does not state the GPL's own policy; instead it says how far other compatible licenses can go. Thus, that text in section 7 would not have established broad patent retaliation; it only would have permitted combining GPL-covered code with other licenses that do such broad patent retaliation.
tr: 7. bölüm GPL'nin kendi politikasını ifade etmiyor; aksine diğer uyumlu lisansların nereye kadar gidebileceğini söylüyor. Böylece, 7. bölüm geniş bir patent misillemesi oluşturmazdı; sadece GPL kapsamındaki kod ile bu gibi geniş bir patent misillemesi içeren lisanslarla birleşimine izin verirdi.

source: Nonetheless, as explained in the Rationale for Draft 3, such broad retaliation was criticized because it could apply to software patent lawsuits in which the accused software was unrelated to the software that was the subject of the license. Seeing that there were no widely used licenses with which this would provide compatibility, in draft 3 we dropped broad patent retaliation from the range of GPL compatibility.
tr: Her şeye rağmen, 3. taslağın Gerekçesinde açıklandığı gibi, bu gibi geniş patent misillemesinin eleştirilme nedeni, lisansın konusu olan yazılımla ilişkili olmayan yazılımın zanlısı olduğu yazılım patent davaları için geçerli olabilmesidir. Bununla uyumluluk sağlanabilecek yaygın kullanılan bir lisans olmadığı görüldüğü için, 3. taslakta, bu geniş patent misillemesi GPL uyumluluğunun kapsamından çıkarıldı.

source: We did so by replacing 7(b)(5) with text in section 10, in which we kept only what corresponded to the second category. The first category therefore reverted to being a GPL-incompatible &quot;further restriction&quot; in Draft 3, and likewise in GPL version 3 as actually published.
tr: Bu değişikliği 7(b)(5)'in yerine 10. bölümdeki metni koyarak yaptık, böylece ikinci kategoriye ilişkin kısmı korumuş olduk. İlk kategori 3. taslakta GPL uyumsuz bir &quot;ek kısıtlama&quot; haline, GPL sürüm 3'de yayınlandığı şekle, döndürüldü.

source: <a href="/licenses/gpl-faq.html">Return to the FAQ</a>
tr: <a href="/licenses/gpl-faq.html">SSS'e Dön</a>
