Repository: GitMirroring/www-tr
Catalog: licenses/recommended-copylefts.*.po
Languages: tr

source: Recommended Copyleft Licenses - GNU Project - Free Software Foundation
tr: Önerilen Copyleft Lisanslar - GNU Projesi - Özgür Yazılım Vakfı

source: Recommended Copyleft Licenses
tr: Önerilen Copyleft Lisanslar

source: This page lists the copyleft licenses that we recommend free software projects and associated documentation use.
tr: Bu sayfa özgür yazılım projeleri ve ilişkili belgelendirme kullanımı için önerdiğimiz copyleft lisanslarını listeliyor.

source: Software licenses
tr: Yazılım lisansları

source: The <a href="/licenses/gpl.html">GNU General Public License, version 3</a> or any later version
tr: <a href="/licenses/gpl.html">GNU Genel Kamu Lisansı, sürüm 3</a> veya daha yeni bir sürümü

source: The <a href="/licenses/agpl.html">GNU Affero General Public License, version 3</a> or any later version
tr: <a href="/licenses/agpl.html">GNU Affero Genel Kamu Lisansı, sürüm 3</a> veya daha yeni bir sürümü

source: Documentation licenses
tr: Belgelendirme lisansları

source: The <a href="/licenses/fdl.html">GNU Free Documentation License, version 1.3</a> or any later version
tr: <a href="/licenses/fdl.html">GNU Özgür Belgelendirme Lisansı, sürüm 1.3</a> veya daha yeni bir sürümü

source: To learn more about when and why we recommend these licenses, please see <a href="/licenses/license-recommendations.html">How to choose a license for your own work</a>. Note that <strong>only the licenses listed above are recommended copyleft licenses</strong>; other licenses discussed in that guide are not copyleft licenses, or else suggested for use in more narrow circumstances.
tr: Bu lisansları ne zaman ve neden önerdiğimiz hakkında daha fazla bilgi edinmek için <a href="/licenses/license-recommendations.html">Kendi çalışmalarınız için lisans nasıl seçilir</a> yazısına bakabilirsiniz. Lütfen, <strong>yalnızca yukarıda listelenen lisansların copyleft lisanslar olduğunu</strong> unutmayın; bu kılavuzda ele alınan diğer lisanslar copyleft değiller veya çok daha dar bir durum için öneriliyorlar.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
tr: Bu sayfa <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.tr">Creative Commons Alıntı-Türetilemez 4.0 Uluslararası Lisansı</a> altında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>T. E. Kalaycı, 2020.</li> </ul>

source: Updated:
tr: Son Güncelleme:
