Repository: GitMirroring/www-tr
Catalog: fun/dna.*.po
Languages: tr

source: Human DNA as C code - GNU Project - Free Software Foundation
tr: C kodu halinde insan DNA'sı - GNU Projesi - Özgür Yazılım Vakfı

source: GNU Home
tr: GNU Ana Sayfası

source: </a>&nbsp;/ <a href="/fun/humor.html#content">GNU humor</a>&nbsp;/ <a href="/fun/humor.html#Software">Software</a>&nbsp;/
tr: </a>&nbsp;/ <a href="/fun/humor.html#content">GNU mizah</a>&nbsp;/ <a href="/fun/humor.html#Software">Yazılım</a>&nbsp;/

source: Human DNA deciphered into C code!
tr: İnsan DNA’sının şifresi çözülerek C koduna aktarıldı!

source: by Mathew Murphy
tr: yazan Mathew Murphy

source: For many years molecular biologists have been mystified by the fact that very little of an organism's DNA seems to serve any useful function.
tr: Uzun yıllar boyunca moleküler biyologlar, bir organizmanın DNA’sının sadece çok küçük bir bölümünün herhangi bir işe yarar işlevi olduğu gerçeği karşısında şaşkınlık yaşamıştır.

source: I have solved the mystery.
tr: Ben bu gizemi çözdüm.

source: The reason why only 30% of human DNA performs any useful function is that the rest of it is comments.
tr: İnsan DNA'sının sadece %30'unun herhangi işlevsel bir özelliğe sahip olmasının nedeni, geri kalan kısmının yorum olması.

source: Once we decode a typical human genome, we see that the contents begin as follows:
tr: Tipik bir insan genomunun şifresini çözdüğümüzde içeriğinin aşağıdaki gibi başladığını görüyoruz:

source: /* HUMAN_DNA.H * * Human Genome * Version 2.1 * * (C) God */
tr: /* INSAN_DNA.H * * Insan Genomu * Versiyon 2.1 * * (C) Tanrı */

source: /* Revision history: * * 0000-00-01 00:00 1.0 Adam. * 0000-00-02 10:00 1.1 Eve. * 0000-00-03 02:11 1.2 Added penis code to male version. A bit messy -- * will require a rewrite later on to make it neater. * 0017-03-12 03:14 1.3 Added extra sex drive to male.h; took code from * elephant-dna.c * 0145-10-03 16:33 1.4 Removed tail. * 1115-00-31 17:20 1.5 Shortened forearms, expanded brain case. * 2091-08-20 13:56 1.6 Opposable thumbs added to hand() routine. * 2501-04-09 14:04 1.7 Minor cosmetic improvements -- skin colour made * darker to match my own image. * 2909-07-12 02:21 1.8 Dentition inadequate; added extra 'wisdom' teeth. * Must remember to make mouth bigger to compensate. * 4501-12-31 14:18 1.9 Increase average height. * 5533-02-12 17:09 2.0 Added gay option, triggered by high population * density, to try and slow the overpopulation problem. * 6004-11-04 16:11 2.1 Made forefinger narrower to fit hole in centre of * CD. */
tr: /* Düzenleme tarihçesi: * * 0000-00-01 00:00 1.0 Adem. * 0000-00-02 10:00 1.1 Havva. * 0000-00-03 02:11 1.2 Erkek versiyonuna penis kodu eklendi. Bu kısım biraz dağınık -- * daha sonrasında bu kısmı daha temiz olması için tekrardan yazmak gerek. * 0017-03-12 03:14 1.3 erkek.h'ye ekstra cinsel dürtü eklendi; kod fil-dna.c'den alındı. * 0145-10-03 16:33 1.4 Kuyruk kaldırıldı. * 1115-00-31 17:20 1.5 Ön kol kısaltıldı, beyin kalıbı genişletildi. * 2091-08-20 13:56 1.6 Zıt başparmaklar el() rutinine eklendi. * 2501-04-09 14:04 1.7 Minör kozmetik iyileştirmeler -- ten rengi kendi suretıma * benzesin diye koyulaştırıldı. * 2909-07-12 02:21 1.8 Diş dizilimi yetersiz; ekstra 'bilgelik' dişi eklendi. * Bunu telafi etmek için ağzı daha büyük yapmayı unutmamalıyım. * 4501-12-31 14:18 1.9 Ortalama boy arttırıldı. * 5533-02-12 17:09 2.0 Aşırı nüfus artışını yavaşlatmak için yüksek nüfus yoğunluğunda tetiklenen gay opsiyonu eklendi. * 6004-11-04 16:11 2.1 CD'nin deliğine sığması için işaret parmağı inceltildi. */

source: /* Standard definitions */ #define SEX male #define HEIGHT 1.84 #define MASS 68 #define RACE caucasian
tr: /* Standart tanımlamalar */ #define CINSIYET erkek #define BOY 1.84 #define AGIRLIK 68 #define IRK beyaz

source: /* Include inherited traits from parent DNA files. * * Files must be pre-processed with MENDEL program to provide proper * inheritance features. */ #include "mother.h" #include "father.h" #ifndef FATHER #warn("Father unknown -- guessing\n") #include "bastard.h" #endif
tr: /* Ebeveyn DNA dosyalarından kalıtsal özellikleri ekler. * * Dosyalar düzgün kalıtsal özellikleri sağlaması için * MENDEL programıyla ön işlemeden geçmeli. */ #include "anne.h" #include "baba.h" #ifndef BABA #warn("Baba bilinmiyor -- tahmin ediliyor\n") #include "piç.h" #endif

source: /* Set up sex-specific functions and variables */ #include &lt;sex.h&gt; /* Kludged code -- I'll re-design this lot and re-write it as a proper * library sometime soon. */ struct genitals { #ifdef MALE Penis *jt; #endif /* G_spot *g; Removed for debugging purposes */ #ifdef FEMALE Vagina *p; #endif }
tr: /* Spesifik cinsiyet fonksiyonlarının ve değişkenlerinin kurulumu */ #include &lt;cinsiyet.h&gt; /* İdare etmelik kod ---- bunu bir ara baştan adam gibi * tasarlayıp düzgün bir kütüphane haline getireceğim. */ struct cinsel_organlar { #ifdef ERKEK Penis *jt; #endif /* G_noktasi *g; Hata ayıklamak için çıkarılmıştır */ #ifdef KADIN Vajina *p; #endif }

source: /* Initialization bootstrap routine -- called before DNA duplication. * Allocates buffers and sets up protein file pointers */ DNA *zygote_initialize(Sperm *, Ovum *);
tr: /* Başlatma önyükleme rutini -- DNA çoğaltımından önce çağrılır. * Arabellekleri ayırır ve protein dosya işaretçilerini ayarlar. */ DNA *zigot_baslat(Sperm *, Yumurta *);

source: /* MAIN INITIALIZATION CODE * * Returns structures containing pre-processed phenotypes for the organism * to display at birth. * * Will be improved later to make output less ugly. */ Characteristic *lookup_phenotype(Identifier *i);
tr: /* ANA BAŞLATMA KODU * * Organizmanın doğumda sergileyeceği, * ön işlenmiş fenotipleri içeren yapıları döndürür. * * Çıktıyı daha az çirkin yapmak için ileride iyileştirilecektir. */ Karakteristik *fenotip_bak(Tanimlayici *i);

source: &hellip;and so on.
tr: &hellip;ve böyle gidiyor.

source: [ Note that God uses three-space tabs&nbsp;]
tr: [ Tanrı'nın üç boşluklu tablar kullandığına dikkatinizi çekerim&nbsp;]

source: <a href="/fun/jokes/dna.txt">Original email</a>
tr: <a href="/fun/jokes/dna.txt">Özgün e-posta</a>

source: Source:&nbsp; <a href="https://www.netfunny.com/rhf/jokes/91q3/genome.html"> rec.humor.funny</a> (1991).
tr: Kaynak:&nbsp; <a href="https://www.netfunny.com/rhf/jokes/91q3/genome.html"> rec.humor.funny</a> (1991).

source: &lt;<a href="mailto:meta@pobox.com">Mathew Murphy</a>&gt; kindly released this joke under GPL. Thanks Mathew!
tr: &lt;<a href="mailto:meta@pobox.com">Mathew Murphy</a>&gt; bu espriyi GPL kapsamında yayımlamayı nezaketle kabul etti. Teşekkürler Mathew!

source: *GNUN-SLOT: TRANSLATOR'S NOTES*"
tr: <p><em>Çevirmen notu: Buradaki mizah unsurları İngilizce kelime oyunlarına dayanmaktadır. Türkçede anlamı olabildiğince aslına benzer şekilde korumaya çalıştım fakat yine de anlam kaymaları olmuş olabilir.</em></p>

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: &ldquo;Human DNA deciphered into C code!&rdquo; is licensed under the <a rel="license" href="/licenses/gpl.html">GNU General Public License</a>, version&nbsp;2 or later.
tr: &ldquo;İnsan DNA’sının şifresi çözülerek C koduna aktarıldı!&rdquo; <a rel="license" href="https://www.gnu.org/licenses/gpl-3.0.tr.html">GNU Genel Kamu Lisansı</a>, &nbsp;2 veya üstü altında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>A. Arslantaş, 2025</li> </ul>

source: Updated:
tr: Son Güncelleme:
