Repository: GitMirroring/www-tr
Catalog: fun/humor.*.po
Languages: tr

source: Laugh along with GNU - GNU Project - Free Software Foundation
tr: GNU ile birlikte gülün - GNU Projesi - Özgür Yazılım Vakfı

source: Laugh along with GNU
tr: GNU ile birlikte gülün

source: This section is designed to provide some laughs to the working hackers. It contains software, documentation, music, poems, etc. submitted by GNU users and collected by GNU contributors over the years.
tr: Bu bölüm, çalışan üstatlara biraz eğlence sunmak için tasarlanmıştır. GNU kullanıcıları tarafından gönderilen ve GNU katkıcıları tarafından yıllar boyunca toplanan yazılımlar, belgeler, müzikler, şiirler vb. içerir.

source: Nowadays there are many places on the internet where people can publish jokes, so before submitting a joke to us, please consider publishing it somewhere else. Jokes submitted by GNU contributors will have a priority. Please read the <a href="#Guidelines">Guidelines</a> for details on our submission policy.
tr: Günümüzde internette insanların şakalar yayınlayabileceği birçok yer var, bu yüzden bize bir şaka göndermeden önce lütfen başka bir yerde yayınlamayı düşünün. GNU katkıcıları tarafından gönderilen şakalar öncelikli olacaktır. Gönderim politikamızla ilgili ayrıntılar için lütfen <a href="#Guidelines">Yönergeler</a> bölümünü okuyun.

source: Many of the graphics in the <a href="/graphics/graphics.html">GNU Art Gallery</a> also have humorous twists.
tr: <a href="/graphics/graphics.html">GNU Sanat Galerisi</a>'ndeki grafiklerin çoğu da mizahi bir yaklaşıma sahiptir.

source: Computing
tr: Bilişim

source: <a href="/fun/jokes/10-kinds-of-people.html">10 Kinds of People in the World</a>
tr: <a href="/fun/jokes/10-kinds-of-people.html">Dünyadaki 10 Tür İnsan</a>

source: <a href="/fun/jokes/any-key.html">Where is any-key??</a>
tr: <a href="/fun/jokes/any-key.html">Any tuşu nerede??</a>

source: <a href="/fun/jokes/deadbeef.html">Dead Beef</a>?
tr: <a href="/fun/jokes/deadbeef.html">Ölü Sığır</a>?

source: What does Dr. Emacs think of the <a href="/fun/jokes/doctor.manifesto.html">GNU Manifesto</a>?
tr: Dr. Emacs, <a href="/fun/jokes/doctor.manifesto.html">GNU Bildirisi</a> hakkında ne düşünüyor?

source: <a href="/fun/jokes/evilmalware.html">Why GNU/Linux Viruses are fairly uncommon</a>
tr: <a href="/fun/jokes/evilmalware.html">GNU/Linux virüsleri neden oldukça nadir </a>

source: <a href="/fun/jokes/gcc_audio.html">A Swarm of Gnats?</a>
tr: <a href="/fun/jokes/gcc_audio.html">Bir Gnat Sürüsü mü?</a>

source: <a href="/fun/jokes/gullibility.virus.html">The Gullibility Virus</a>
tr: <a href="/fun/jokes/gullibility.virus.html">Saflık Virüsü</a>

source: <a href="/fun/jokes/p5.delay.html">Top 10 reasons why Intel delayed announcing the P5</a>
tr: <a href="/fun/jokes/p5.delay.html">Intel'in P5'i duyurmayı ertelemesinin en önemli 10 nedeni</a>

source: <a href="/fun/jokes/programmer.txt">You know you're a programmer when&hellip;</a>
tr: <a href="/fun/jokes/programmer.txt">Şu durumlarda programcı olduğunuzu anlarsınız&hellip;</a>

source: <a href="/fun/jokes/unreliable.net.html">Top 10 Unreliable Networks</a>
tr: <a href="/fun/jokes/unreliable.net.html">En Güvenilmez 10 Ağ</a>

source: <a href="/fun/jokes/virus-warning.html">Virus Warning</a>
tr: <a href="/fun/jokes/virus-warning.html">Virüs Uyarısı</a>

source: <a href="/fun/jokes/xmodmap.html">Physical Xmodmap, or The Dvorak Typewriter Hack</a>
tr: <a href="/fun/jokes/xmodmap.html">Fiziksel Xmodmap veya Dvorak Daktilo Hack'i</a>

source: <a href="https://web.archive.org/web/20150224010742/http://www.joke-archives.com/computers/deletedcharacters.html"> Where Do Deleted Characters Go?</a>
tr: <a href="https://web.archive.org/web/20150224010742/http://www.joke-archives.com/computers/deletedcharacters.html">Silinen karakterler nereye gider?</a>

source: Software
tr: Yazılım

source: <a href="/fun/jokes/brainfuck.html">Source code for ed in BrainFuck ;-)</a>
tr: <a href="/fun/jokes/brainfuck.html">BrainFuck'ta ed için kaynak kodu ;-)</a>

source: <a href="/fun/jokes/c+-.html">C more or less</a>
tr: <a href="/fun/jokes/c+-.html">C çok veya az</a>

source: GPL'd <a href="/fun/jokes/dna.html">source code</a> for humans
tr: İnsanlar için GPL lisanslı <a href="/fun/jokes/dna.html">kaynak kodu</a>

source: <a href="/fun/jokes/ed.html">Source code for ed :-)</a>
tr: <a href="/fun/jokes/ed.html">ed için kaynak kodu :-)</a>

source: <a href="/fun/jokes/emacs.man">Emacs man page from Plan9</a>
tr: <a href="/fun/jokes/emacs.man">Plan9'dan Emacs man sayfası</a>

source: <a href="/fun/jokes/errno.2.html">Errno codes</a>
tr: <a href="/fun/jokes/errno.2.html">Errno kodları</a>

source: <a href="/fun/jokes/error-haiku.html">Error messages</a> in Haiku
tr: Haiku <a href="/fun/jokes/error-haiku.html">Hata mesajları</a>

source: <a href="/fun/jokes/gcc.html">Suggested GCC Options</a>
tr: <a href="/fun/jokes/gcc.html">Önerilen GCC Seçenekleri</a>

source: <a href="/fun/jokes/happy-new-year.html">Happy New Year in 4 languages</a>
tr: <a href="/fun/jokes/happy-new-year.html">4 dilde Mutlu Yıllar</a>

source: <a href="/fun/jokes/hello_world_patent.html">The Swedish YAAS Foundation Patent</a>
tr: <a href="/fun/jokes/hello_world_patent.html">İsveç YAAS Vakfı Patenti</a>

source: <a href="/fun/jokes/long-options.html">Long Options?</a>
tr: <a href="/fun/jokes/long-options.html">Uzun Seçenekler?</a>

source: <a href="/fun/jokes/merry-xmas.html">Merry Christmas in 4 languages</a>
tr: <a href="/fun/jokes/merry-xmas.html">4 dilde Mutlu Noeller</a>

source: <a href="/fun/jokes/pasta.code.html">Spaghetti Code</a>
tr: <a href="/fun/jokes/pasta.code.html">Spagetti Kodu</a>

source: <a href="/fun/jokes/santa_comes_to_town.html">Santa Claus comes to town</a>
tr: <a href="/fun/jokes/santa_comes_to_town.html">Noel Baba kasabaya geliyor</a>

source: <a href="/fun/jokes/software.terms.html">Software Terms</a>
tr: <a href="/fun/jokes/software.terms.html">Yazılım Terimleri</a>

source: <a href="/fun/jokes/unix.errors.html">Unix Error Messages</a>
tr: <a href="/fun/jokes/unix.errors.html">Unix Hata Mesajları</a>

source: <a href="https://web.archive.org/web/20110411021200/https://twitter.com/1990sLinuxUser"> Some humor via Twitter</a>
tr: <a href="https://web.archive.org/web/20110411021200/https://twitter.com/1990sLinuxUser">Twitter'den biraz mizah</a>

source: Documentation
tr: Belgeleme

source: <a href="/fun/jokes/gnuemacs.acro.exp.html">GNU Emacs acronym expansions</a>
tr: <a href="/fun/jokes/gnuemacs.acro.exp.html">GNU Emacs kısaltma genişletmeleri</a>

source: <a href="/fun/jokes/know.your.sysadmin.html">Know your system administrator</a>
tr: <a href="/fun/jokes/know.your.sysadmin.html">Sistem yöneticinizi tanıyın</a>

source: <a href="/fun/jokes/power.users.html">Power Users Guide</a>
tr: <a href="/fun/jokes/power.users.html">Yetkili Kullanıcılar Kılavuzu</a>

source: Science and Engineering
tr: Bilim ve Mühendislik

source: <a href="/fun/jokes/phone.features.html">Phone Features</a>
tr: <a href="/fun/jokes/phone.features.html">Telefon Özellikleri</a>

source: <a href="/fun/jokes/physics.html">The Physics Store!</a>
tr: <a href="/fun/jokes/physics.html">Fizik Mağazası!</a>

source: Some <a href="/fun/jokes/science.facts.html">Scientific Facts</a>
tr: Bazı <a href="/fun/jokes/science.facts.html">Bilimsel Gerçekler</a>

source: Music
tr: Müzik

source: See <a href="/music/music.html">GNU Music and Songs</a>
tr: <a href="/music/music.html">GNU Müzik ve Şarkılar</a> bölümüne bakın.

source: Poems
tr: Şiirler

source: <a href="/fun/jokes/last.bug.html">The Last Bug</a>
tr: <a href="/fun/jokes/last.bug.html">Son Hata</a>

source: <a href="/fun/jokes/midnight.dreary.html">Midnight Dreary</a>
tr: <a href="/fun/jokes/midnight.dreary.html">Gece Yarısı Kasvetli</a>

source: <a href="/fun/jokes/networkologist.html">A Networkologist's Christmas</a>
tr: <a href="/fun/jokes/networkologist.html">Bir Ağ Bilimcisinin Noeli</a>

source: Philosophy
tr: Felsefe

source: See <a href="/philosophy/third-party-ideas.html#humor">the Philosophical Humor section in Third Party Ideas</a>
tr: <a href="/philosophy/third-party-ideas.html#humor">Üçüncü Taraf Fikirleri bölümündeki Felsefi Mizah kısmına bakın</a>.

source: Societal Issues
tr: Toplumsal Sorunlar

source: <a href="/fun/jokes/right-to-repair-wins.html">Right to Repair Wins</a>
tr: <a href="/fun/jokes/right-to-repair-wins.html">Onarım Hakkı Kazandı</a>

source: The Fourth Estate
tr: Dördüncü Güç

source: <a href="/fun/jokes/look-and-feel.html">Look and Feel</a>
tr: <a href="/fun/jokes/look-and-feel.html">Görünüm ve His</a>

source: <a href="/fun/jokes/microsoft-church.html">Microsoft and the Church</a>
tr: <a href="/fun/jokes/microsoft-church.html">Microsoft ve Kilise</a>

source: <a href="/fun/jokes/rectium.html">Rectium?</a>
tr: <a href="/fun/jokes/rectium.html">Rectium mu?</a>

source: <a href="/fun/jokes/unix-hoax.html">Unix, a Hoax?</a>
tr: <a href="/fun/jokes/unix-hoax.html">Unix, bir aldatmaca mı?</a>

source: Dictionary and Word Play
tr: Sözlük ve Kelime Oyunları

source: <a href="/fun/jokes/anagrams.html">Anagrams</a> for some common words
tr: Bazı yaygın kelimeler için <a href="/fun/jokes/anagrams.html">Anagramlar</a>

source: <a href="/fun/jokes/fsf-in-german.html">FSF in German</a>
tr: <a href="/fun/jokes/fsf-in-german.html">Almanca FSF</a>

source: <a href="/fun/jokes/fundefinitions1.html">Fun Definitions 1</a>
tr: <a href="/eğlence/şakalar/eğlenceli-tanımlar1.html">Eğlenceli Tanımlar 1</a>

source: <a href="/fun/jokes/fundefinitions2.html">Fun Definitions 2</a>
tr: <a href="/fun/jokes/fundefinitions2.html">Eğlenceli Tanımlar 2</a>

source: <a href="/fun/jokes/grammar-in-the-bar.html">Grammar in the bar</a>
tr: <a href="/fun/jokes/grammar-in-the-bar.html">Barda gramer</a>

source: <a href="/fun/jokes/musical-pickup.html">Musical pickup</a>
tr: <a href="/fun/jokes/musical-pickup.html">Müzikal tanışma</a>

source: <a href="/fun/jokes/spilling-checker.html">Spilling Checker</a>
tr: <a href="/fun/jokes/spilling-checker.html">Dökme Denetleyicisi</a>

source: <a href="/fun/jokes/typoglycemia.html">Typoglycemia</a>
tr: <a href="/eğlence/şakalar/tipoglisemi.html">Tipoglisemi</a>

source: <a href="/fun/spam/sheep.html">Inflatable Sheep</a>
tr: <a href="/fun/spam/sheep.html">Şişme Koyun</a>

source: <a href="/fun/spam/warpgenerator.html">Dimensional Warp Generator Needed</a>
tr: <a href="/fun/spam/warpgenerator.html">Boyutsal Warp Jeneratörü Gerekli</a>

source: Unclassified
tr: Sınıflandırılmamış

source: <a href="/fun/jokes/bug.war.html">A war against bugs</a>!
tr: <a href="/fun/jokes/bug.war.html">Hatalarla savaş</a>!

source: Funny <a href="/fun/jokes/courtroom.quips.html">Court Statements</a>
tr: Komik <a href="/fun/jokes/courtroom.quips.html">Mahkeme İfadeleri</a>

source: <a href="/fun/jokes/freesoftware.html">Free Software Hack</a>
tr: <a href="/fun/jokes/freesoftware.html">Özgür Yazılım Hack</a>

source: A luser's <a href="/fun/jokes/luser-vs-rms.html">interaction</a> with <a href= "http://www.stallman.org/">rms</a>
tr: Bir luser'ın, <a href="http://www.stallman.org/">rms</a> ile <a href="/fun/jokes/luser-vs-rms.html">etkileşimi</a>

source: <a href="/fun/jokes/paging.game.html">The Paging Game</a>
tr: <a href="/fun/jokes/paging.game.html">Sayfalama Oyunu</a>

source: <a href="/fun/jokes/quotations.html">Quotations</a>
tr: <a href="/fun/jokes/quotations.html">Alıntılar</a>

source: <a href="/fun/jokes/smileys.html">Smileys :-)</a>
tr: <a href="/fun/jokes/smileys.html">Gülücükler :-)</a>

source: <a href="/fun/jokes/users-lightbulb.html">How many GNU/Linux users are needed to change a light bulb?</a>
tr: <a href="/fun/jokes/users-lightbulb.html">Bir ampulü değiştirmek için kaç tane GNU/Linux kullanıcısı gerekir?</a>

source: <a href="/fun/jokes/wolf-logo.html">The Wolf Logo</a>
tr: <a href="/fun/jokes/wolf-logo.html">Wolf Logosu</a>

source: Humor Submission Guidelines
tr: Mizah Gönderim Kuralları

source: This is our policy to include something in the fun section:
tr: Şunlar eğlence bölümüne bir şeyler eklemek için politikamızdır:

source: It should be funny.
tr: Komik olmalı.

source: It has no copyright problems.
tr: Telif hakkı sorunu yoktur.

source: It is not libelous.
tr: Bu iftira değildir.

source: It won't offend most ordinary hackers more than is reasonable in humor.
tr: Çoğu sıradan üstadı mizah sınırları içinde makul ölçüde rahatsız etmeyecektir.

source: Although the humor does not have to be strictly connected to the computers world, we strongly prefer to reserve these pages for jokes related to free software, GNU, the UNIX environment, and similar fields.
tr: Mizahın bilgisayar dünyasıyla sıkı bir bağlantısı olması gerekmese de, bu sayfaları özgür yazılım, GNU, UNIX ortamı ve benzeri alanlarla ilgili şakalar için ayırmayı tercih ediyoruz.

source: Disclaimer
tr: Feragatname

source: Much of the material on this page (and linked to from it) was obtained from the FSF's email archives of the GNU Project. The Free Software Foundation claims no copyrights on these.
tr: Bu sayfadaki (ve bu sayfadan bağlantı verilen) materyallerin çoğu, FSF'nin GNU Projesi e-posta arşivlerinden elde edilmiştir. Özgür Yazılım Vakfı, bunlar üzerinde herhangi bir telif hakkı iddiasında bulunmamaktadır.

source: ***&nbsp;&nbsp;And we'll end this page with a perfect <a href="/fun/jokes/purchase.agreement.html">Disclaimer</a>!&nbsp;&nbsp;***
tr: ***&nbsp;&nbsp;Ve bu sayfayı mükemmel bir <a href="/fun/jokes/purchase.agreement.html">Feragatname</a> ile bitireceğiz!&nbsp;&nbsp;***

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
tr: Son Güncelleme:

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
tr: Bu sayfa <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.tr">Creative Commons Alıntı-Türetilemez 4.0 Uluslararası Lisansı</a> altında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: T. E. Kalaycı, 2025

source: Updated:
tr: Son Güncelleme:
