Repository: GitMirroring/www-tr
Catalog: philosophy/basic-freedoms.*.po
Languages: tr

source: Freedom of Speech, Press and Association on the Internet - GNU Project - Free Software Foundation
tr: İnternet Üzerinde İfade, Basın ve Örgütlenme Özgürlüğü - GNU Projesi - Özgür Yazılım Vakfı

source: Freedom of Speech, Press, and Association on the Internet
tr: İnternet Üzerinde İfade, Basın ve Örgütlenme Özgürlüğü

source: The Free Software Foundation supports the freedoms of speech, press, and association on the Internet. Please check out:
tr: Özgür Yazılım Vakfı İnternet üzerinde ifade, basın ve örgütlenme özgürlüğünü desteklemektedir. Lütfen gözden geçirin:

source: The <a href="https://web.archive.org/web/19990424100121/http://www.ciec.org/">Citizens Internet Empowerment Coalition</a> at the Wayback Machine (archived April 24, 1999) came together to oppose Congress' first attempt to regulate material published on the Internet, the Communications Decency Act, which the U.S. Supreme Court found unconstitutional on June 26, 1997. Their site is being preserved as a resource on the landmark CDA case.
tr: Wayback Machine (arşiv tarihi 24 Nisan 1999)'deki <a href="https://web.archive.org/web/19990424100121/http://www.ciec.org/">Yurttaşların İnternet Güçlendirme Koalisyonu</a> ile birlikte Kongre'nin İnternet üzerinde yayınlanan malzemeyi düzenlemeye yönelik ilk çabası olan, ABD Yüksek Mahkemesi tarafından 26 Haziran 1997'de anayasaya aykırı bulunan İletişim Nezaket Yasasına karşı birlikte hareket ettik. Siteleri İNY davasının bir simgesinin kaynağı olarak saklanmıştır.

source: The <a href="https://web.archive.org/web/19980709161803/http://vtw.org/">Voters Telecommunications Watch</a> at the Wayback Machine (archived July 09, 1998) and their excellent announcement electronic mailing list.
tr: Wayback Machine (arşiv tarihi 9 Temmuz 1998)'deki <a href="https://web.archive.org/web/19980709161803/http://vtw.org/">Oy Kullananların Telekomünikasyon Gözcüsü</a> ve muhteşem duyuru elektronik e-posta listesi.

source: <a href="/philosophy/censoring-emacs.html">Censoring GNU Emacs</a> describes how the Communications Decency Act required the GNU Project to censor GNU Emacs&mdash;and how this paradoxically had the opposite of the effect that the censors wanted.
tr: <a href="/philosophy/censoring-emacs.html">GNU Emacs'i Sansürleme</a>, İletişim Nezaket Yasasının nasıl da GNU Projesinden GNU Emacs'i sansürlemesini istediğini ve bunun nasıl da çelişkili bir biçimde sansürlerin arzuladığı etkinin tam da karşıtına yol açtığını anlatıyor.

source: <a href="https://www.factnetglobal.org/">F.A.C.T.Net Inc.</a> is a non-profit Internet digest, news service, library, dialogue center, and archive dedicated to the promotion and defense of international free thought, free speech, and privacy rights.
tr: <a href="https://www.factnetglobal.org/">F.A.C.T.Net Inc.</a>, uluslararası düşünce özgürlüğü, ifade özgürlüğü ve gizlilik haklarının teşvik edilmesi ve savunulmasına adanmış kâr amacı gütmeyen bir İnternet derlemesi, haber hizmeti, kütüphane, iletişim merkezi ve arşivdir.

source: The <a href="https://www.eff.org/pages/blue-ribbon-campaign">Blue Ribbon Campaign</a> for Online Freedom of Speech, Press and Association.
tr: Çevrimiçi İfade, Basın ve Örgütlenme Özgürlüğü için <a href="https://www.eff.org/pages/blue-ribbon-campaign">Mavi Kurdele Kampanyası</a>.

source: You can read <a href="https://web.archive.org/web/20011201050533/http://www.vtw.org/speech/">the June 1996 appeals court decision</a> at the Wayback Machine (archived December 01, 2001) rejecting censorship of the Internet. But remember, this decision is <em>not</em> final! First, the Supreme Court will agree or disagree; then Congress gets a chance to look for another method of censorship.
tr: Wayback Machine (arşiv tarihi 1 Aralık 2001)'deki İnternet sansürünü reddeden<a href="https://web.archive.org/web/20011201050533/http://www.vtw.org/speech/">mahkeme kararına yönelik Haziran 1996 temyizlerini</a> okuyabilirsiniz. Ancak unutmayın, bu karar nihai karar <em>değildir</em>! İlk olarak Yüksek Mahkeme bu karara katılacak ve katılmayacak, daha sonra da Kongre başka bir sansür yöntemini aramak için bir şans elde edecektir.

source: <a href="/philosophy/savingeurope.html">Saving Europe from Software Patents</a>
tr: <a href="/philosophy/savingeurope.html">Avrupa'yı Yazılım Patentlerinden Korumak</a>

source: <a href="/links/links.html#FreedomOrganizations">Organizations</a> that work for freedom in computer development and electronic communications.
tr: Bilgisayar geliştirme ve elektronik iletişimde özgürlük için çalışan <a href="/links/links.html#FreedomOrganizations">Örgütler</a>.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
tr: Bu sayfa <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.tr">Creative Commons Alıntı-Türetilemez 4.0 Uluslararası Lisansı</a> altında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>T. E. Kalaycı, 2020.</li> </ul>

source: Updated:
tr: Son Güncelleme:
