Repository: GitMirroring/www-tr
Catalog: philosophy/whats-wrong-with-youtube.*.po
Languages: tr

source: What's Wrong with YouTube - GNU Project - Free Software Foundation
tr: YouTube'de Neler Yanlış - GNU Projesi - Özgür Yazılım Vakfı

source: What's Wrong with YouTube
tr: YouTube'de Neler Yanlış

source: Normal use of YouTube involves running nonfree software.
tr: YouTube'un normal kullanımı özgür olmayan yazılım çalıştırmayı içerir.

source: The YouTube video player is a <a href="/philosophy/javascript-trap.html">nonfree JavaScript program</a>. Some videos also require the nonfree Adobe DRM software that has been incorporated into proprietary browsers and Firefox, but not into the GNU browsers, including <a href="/software/icecat">IceCat</a>.
tr: YouTube video oynatıcısı <a href="/philosophy/javascript-trap.html">özgür olmayan bir JavaScript programıdır</a>. Bazı videolar ayrıca, özel mülk tarayıcılara ve Firefox'a dahil edilmiş ancak <a href="/software/icecat">IceCat</a> dahil olmak üzere, GNU tarayıcılarına dahil edilmemiş olan özgür olmayan Adobe DRM yazılımını da gerektirir.

source: However, there are ways to watch YouTube videos without running any nonfree software:
tr: Ancak, herhangi bir özgür olmayan yazılım çalıştırmadan YouTube videolarını izlemenin yolları vardır:

source: <em><a href="https://invidious.io/">Invidious</a> intermediary sites</em>. Some of them allow visits via Tor, or even have an onion URL. As of 2025, the instances that are listed in the Invidious documentation try to keep AI crawlers away with a JavaScript CAPTCHA program. This program is free, but we recommend enabling the LibreJS add-on as a matter of precaution, should they use a nonfree program in the future.
tr: <em><a href="https://invidious.io/">Invidious</a> aracı siteleri</em>. Bazıları Tor üzerinden ziyaretlere izin veriyor veya hatta bir onion URL'si bile var. 2025 itibarıyla, Invidious belgelerinde listelenen örnekler, bir JavaScript CAPTCHA programıyla YZ tarayıcılarını uzak tutmaya çalışıyor. Bu program ücretsizdir, ancak gelecekte özgür olmayan bir program kullanmaları durumunda önlem olarak LibreJS eklentisini etkinleştirmenizi öneririz.

source: <em>The free <a href="http://sebaro.pro/viewtube/">ViewTube</a> add-on</em>, which permits direct access to videos on YouTube in various browsers. It is preinstalled in GNU IceCat, and you can load it into Firefox. But youtube.com is likely to block this means of access if you come via Tor.
tr: <em>Özgür <a href="http://sebaro.pro/viewtube/">ViewTube</a> eklentisi</em>, çeşitli tarayıcılarda YouTube'daki videolara doğrudan erişime izin verir. GNU IceCat'e önceden yüklenmiştir ve Firefox'a da yükleyebilirsiniz. Ancak Tor üzerinden gelirseniz youtube.com'un bu erişim yolunu engellemesi muhtemeldir.

source: YouTube tries to stop people from downloading copies.
tr: YouTube, insanların kopyaları indirmesini engellemeye çalışıyor.

source: The nonfree JavaScript code does not allow browsers to save a copy, even when the video is under a license that allows redistribution. This is a form of DRM that can't even pretend to &ldquo;enforce copyright.&rdquo;
tr: Özgür olmayan JavaScript kodu, videonun yeniden dağıtımına izin veren bir lisans altında olması durumunda bile tarayıcıların bir kopyayı kaydetmesine izin vermez. Bu, &ldquo;telif hakkını uygulamaya&rdquo; bile kalkışamayan bir DRM biçimidir.

source: As for the mobile app, which is nonfree as well, it graciously <a href="https://support.google.com/youtube/answer/7381437">lets paying Premium users store videos for up to 30 days</a>, after which it deletes those copies. These are stored with DRM, meaning they can only be played inside the app, and cannot be played from external software or transferred to an external device.
tr: Özgür olmayan mobil uygulama içinse, <a href="https://support.google.com/youtube/answer/7381437">ücret ödeyen Premium kullanıcıların videoları 30 güne kadar saklamasına</a> nezaketle izin veriyor ve ardından bu kopyaları siliyor. Bunlar DRM ile saklanır, yani yalnızca uygulama içinde oynatılabilir ve harici bir yazılımdan oynatılamaz veya harici bir cihaza aktarılamaz.

source: However, some free programs bypass this block:
tr: Ancak bazı özgür programlar bu engeli aşabiliyor:

source: <em><a href="https://github.com/yt-dlp/yt-dlp/releases"> yt-dlp</a></em>, which in spite of being hosted on GitHub can be downloaded with a browser without running JavaScript. It can also be downloaded from the command line. For example:
tr: <em><a href="https://github.com/yt-dlp/yt-dlp/releases"> yt-dlp</a></em>, GitHub'da barındırılmasına rağmen JavaScript çalıştırmadan bir tarayıcıyla indirilebilir. Ayrıca komut satırından da indirilebilir. Örneğin:

source: The <em>ViewTube</em> add-on.
tr: <em>ViewTube</em> eklentisi.

source: Free/libre access methods may not work in the future.
tr: Gelecekte özgür erişim yöntemleri çalışmayabilir.

source: As a result of the <a href="#free-access">access methods</a> above, posting videos on YouTube does not currently put them off limits to the free world. That is good, and we hope it lasts, but we cannot count on them to keep working. The ViewTube add-on broke once in 2019 because of some change in YouTube. That time, a corrected add-on was released after a few weeks. Next time, who knows? Thus, posting on YouTube is a fragile solution unless/until Google commits to supporting libre access.
tr: Yukarıdaki <a href="#free-access">erişim yöntemleri</a> sonucunda, YouTube'da video yayınlamak şu anda onları özgür dünyanın dışında tutmuyor. Bu iyi ve umarız devam eder, ancak çalışmaya devam edeceklerine güvenemeyiz. ViewTube eklentisi 2019'da YouTube'daki bazı değişiklikler nedeniyle bir kez bozuldu. O zaman, birkaç hafta sonra düzeltilmiş bir eklenti yayınlandı. Bir dahaki sefere, kim bilir? Bu nedenle, YouTube'da yayınlamak, Google özgür erişimi desteklemeyi taahhüt edene kadar kırılgan bir çözümdür.

source: If nevertheless you do post a video on YouTube, please don't use the host name youtube.com (or its aliases) to refer to it. Instead, refer to one of the Invidious intermediary sites that accepts visits via Tor (test it!). That is fail-safe: if anything breaks, your link will fail, rather than lead people to run nonfree software.
tr: Yine de YouTube'da bir video yayınlarsanız, lütfen ona atıfta bulunmak için youtube.com ana bilgisayar adını (veya takma adlarını) kullanmayın. Bunun yerine, Tor üzerinden ziyaretleri kabul eden Invidious aracı sitelerinden birine atıfta bulunun (lütfen önce deneyin!). Bu, hataya karşı güvenlidir: herhangi bir şey bozulursa, bağlantınız başarısız olur ve insanları özgür olmayan yazılımları çalıştırmaya yönlendirmez.

source: To post a video without requiring nonfree software to view it, you can place the video as an Ogg Theora or WebM file on an ordinary web site. If you are concerned there will be a lot of download traffic, you can seed a torrent and suggest people download through that.
tr: Videoyu görüntülemek amacıyla özgür olmayan bir yazılım gerektirmeden yayımlamak için videoyu sıradan bir web sitesine Ogg Theora veya WebM dosyası olarak yerleştirebilirsiniz. Çok fazla indirme trafiği olacağından kaygılanıyorsanız bir torrent paylaşabilirsiniz ve insanların bu şekilde indirmesini önerebilirsiniz.

source: Another way to publish videos on the web using free software is <a href="https://mediagoblin.org">GNU MediaGoblin</a>. Ideally you will set up <a href="https://docs.mediagoblin.org/en/master/">your own server</a>, or run one for your family and friends, but you can also post on <a href="https://wiki.mediagoblin.org/Live_instances">public servers</a>.
tr: Özgür yazılım kullanarak web'de video yayınlamanın bir diğer yolu <a href="https://mediagoblin.org">GNU MediaGoblin</a>'dir. İdeal olarak <a href="https://docs.mediagoblin.org/en/master/">kendi sunucunuzu</a> kuracaksınız veya aileniz ve arkadaşlarınız için bir tane çalıştıracaksınız, ancak <a href="https://wiki.mediagoblin.org/Live_instances">genel sunuculara</a> da gönderebilirsiniz.

source: Please <a href="https://wiki.mediagoblin.org/HackingHowto"> contribute to GNU MediaGoblin</a> if you can.
tr: Lütfen, yapabiliyorsanız, <a href="https://wiki.mediagoblin.org/HackingHowto"> GNU MediaGoblin'e katkıda bulunun</a>.

source: One thing about YouTube that is <em>not</em> a moral strike against it is nonfree software on YouTube servers&mdash;if there is any. We as possible users of YouTube can't tell whether the servers run any nonfree software, because that has no effect on us&mdash;therefore it doesn't do any wrong to us.
tr: YouTube ile ilgili olarak, (eğer varsa) YouTube sunucularındaki özgür olmayan yazılım ahlaki bir boykot nedeni <em>değildir</em>. Olası YouTube kullanıcıları olarak sunucuların herhangi bir özgür olmayan yazılım çalıştırıp çalıştırmadıklarını söyleyemeyiz, dolayısıyla bunun bizim üzerimizde hiçbir etkisi yoktur, bu nedenle bize karşı yaptığı bir kötülük yoktur.

source: If there are any nonfree programs running on YouTube servers, they mistreat Google by denying Google control of that aspect of its computing. We hope that Google will reclaim its freedom by ceasing to use those nonfree programs, if any. But those programs do not mistreat the <em>users</em> of YouTube, so they are not a reason to refuse to <em>use</em> that service.
tr: YouTube sunucularında çalışan herhangi bir özgür olmayan program varsa, Google'nin kendi gerçekleştirdiği bilişimin bu yönü üzerindeki Google denetimini reddederek Google'ye kötü davranırlar. Google'nin eğer varsa bu özgür olmayan programları kullanmayı bırakarak özgürlüğünü geri kazanmasını umuyoruz. Ancak bu programlar YouTube <em>kullanıcılarına</em> kötü davranmaz, bu yüzden onlar bu hizmeti <em>kullanmayı</em> reddetmek için bir neden değildir.

source: It is also possible that all the software running on YouTube servers is free&mdash;either published free software or private unreleased free software.
tr: YouTube sunucularında çalışan tüm yazılımların özgür olması da mümkündür, ya yayımlanmış özgür yazılım ya da özel, yayımlanmamış özgür yazılım.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
tr: Bu sayfa <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.tr">Creative Commons Alıntı-Türetilemez 4.0 Uluslararası Lisansı</a> altında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>The FLOSS Information <a href="mailto:theflossinformation@gmail.com">&lt;theflossinformation@gmail.com&gt;</a>, 2020.</li> </ul>

source: Updated:
tr: Son Güncelleme:
