Repository: GitMirroring/www-tr
Catalog: education/drm-*-school-ebooks-when-life-imitates-dystopian-stories.*.po
Languages: tr

source: It is forbidden to attempt to learn how the dis-service works by reverse-engineering, attempting to derive source code, or by any other means.
tr: Sistemin çalışma prensibini tersine mühendislik yoluyla, kaynak kodunu elde etmeye çalışarak veya başka herhangi bir yolla öğrenmeye teşebbüs etmek yasaktır.

source: The books are region-locked (only accessible in a certain area) to the Republic of Ireland.
tr: Kitaplar, İrlanda Cumhuriyeti'ne özel olarak bölgesel kısıtlamaya tabidir (sadece belirli bir bölgeden erişilebilir).

source: No warranties are provided. The dis-service shall not be liable for any damages, yet expects you to be liable for damages to them.
tr: Hiçbir garanti verilmemektedir. Hizmet sağlayıcı herhangi bir zarardan sorumlu tutulmayacak, ancak sizin onlara vereceğiniz zararlardan sorumlu olmanızı beklemektedir.

source: Thanks
tr: Teşekkürler

source: Thanks to Richard Stallman, Andy Oram, and the GNU Education Team for the idea and the help.
tr: Fikir ve yardımları için Richard Stallman, Andy Oram ve GNU Eğitim Ekibine teşekkürler.

source: <a href="#barra-rev" id="barra">[*]</a> Barra O'Cathain is a young hacker from Ireland. He is currently persuing a bachelor's degree in Computer Science. His fascination with free software and programming began when he came across the Quake III Arena source code, which was made available under the GNU GPL in 2005.
tr: <a href="#barra-rev" id="barra">[*]</a> Barra O'Cathain, İrlandalı genç bir bilgisayar üstadıdır. Şu anda Bilgisayar Bilimleri alanında lisans derecesi almaktadır. Özgür yazılım ve programlamaya olan ilgisi, 2005 yılında GNU GPL lisansı altında kullanıma sunulan Quake III Arena kaynak koduna rastlamasıyla başladı.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
tr: Bu yazıda kullanılan hacker, üstat anlamındadır: teknik beceri sahibi, problem çözmeden zevk alan ve sınırları aşan kişiler, belirli bir konuda sahip olduğu bilgiyi kullanıp daha fazlasını öğrenmeye meraklı kişiler.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
tr: Lütfen FSF ve GNU ile ilgili sorularınızı <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a> adresine iletin. FSF ile iletişim kurmanın <a href="/contact/">başka yolları</a> da vardır. Lütfen çalışmayan bağlantıları ve başka düzeltmeleri veya önerilerinizi <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a> adresine gönderin.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and contributing translations of this article.
tr: Çevirilerimizde bulmuş olabileceğiniz hataları, aklınızdaki soru ve önerilerinizi lütfen <a href="mailto:web-translators@gnu.org">bize&nbsp;bildirin</a>.</p><p>Bu yazının çeviri düzenlemesi ve sunuşu ile ilgili bilgi için lütfen <a href="/server/standards/README.translations.html">Çeviriler BENİOKU</a> sayfasına bakın. Bu sayfanın ve diğer tüm sayfaların Türkçe çevirileri gönüllüler tarafından yapılmaktadır; Türkçe niteliği yüksek bir <a href="/home.html">www.gnu.org</a> için bize yardımcı olmak istiyorsanız, <a href="https://savannah.gnu.org/projects/www-tr">çalışma&nbsp;sayfamızı</a> ziyaret edebilirsiniz.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 International License</a>.
tr: Bu sayfa <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 Uluslararası Lisansı</a> kapsamında lisanslanmıştır.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
tr: <p><strong>Çeviriye katkıda bulunanlar:</strong></p> <ul> <li>Mert Gör <a href="mailto:mertgor@masscollabs.xyz">&lt;mertgor@masscollabs.xyz&gt;</a>, 2025.</li> </ul>

source: Updated:
tr: Son Güncelleme:
