Repository: GitMirroring/www-tr
Catalog: education/education-menu.*.po
Languages: tr

source: <a href="#content"><span>BACK TO TOP </span>&#11165;</a>
tr: <a href="#content"><span>SAYFA BAŞI </span>&#11165;</a>

source: Education
tr: Eğitim

source: <a href="/education/education.html#content">Main page</a>
tr: <a href="/education/education.html#content">Ana sayfa</a>

source: <a href="/education/edu-cases.html#content">Case studies</a>
tr: <a href="/education/edu-cases.html#content">Durum çalışmaları</a>

source: <a href="/education/edu-cases-argentina.html#content">Argentina</a>
tr: <a href="/education/edu-cases-argentina.html#content">Arjantin</a>

source: <a href="/education/edu-cases-india.html#content">India</a>
tr: <a href="/education/edu-cases-india.html#content">Hindistan</a>

source: <a href="/education/edu-cases-india-ambedkar.html#content">Ambedkar Center</a>
tr: <a href="/education/edu-cases-india-ambedkar.html#content">Ambedkar Merkezi</a>

source: <a href="/education/edu-resources.html#content">Resources</a>
tr: <a href="/education/edu-resources.html#content">Kaynaklar</a>

source: <a href="/education/edu-software.html#content">Educational Software</a>
tr: <a href="/education/edu-software.html#content">Eğitsel Yazılım</a>

source: <a href="/education/edu-projects.html#content">Groups &amp; projects</a>
tr: <a href="/education/edu-projects.html#content">Gruplar ve projeler</a>

source: <a href="/education/edu-free-learning-resources.html#content">Free learning resources</a>
tr: <a href="/education/edu-free-learning-resources.html#content">Özgür öğrenme kaynakları</a>

source: <a href="/education/resisting-proprietary-software.html#content">Resistance</a>
tr: <a href="/education/resisting-proprietary-software.html#content">Direniş</a>

source: <a href="/education/successful-resistance-against-nonfree-software.html#content">Successful resistance</a>
tr: <a href="/education/successful-resistance-against-nonfree-software.html#content">Başarılı direniş</a>

source: <a href="/education/edu-faq.html#content">FAQ</a>
tr: <a href="/education/edu-faq#content">SSS</a>

source: <a href="/education/edu-team.html#content">Our team</a>
tr: <a href="/education/edu-team.html#content">Eğitim ekibi</a>

source: In depth
tr: Ayrıntılı

source: <a href="/education/edu-why.html#content">Why educational institutions should use and teach free software</a>
tr: <a href="/education/edu-why.html#content">Eğitim kurumları neden özgür yazılım kullanmalı ve öğretmeli</a>

source: <a href="/education/edu-schools.html#content">Why schools should exclusively use free software</a>
tr: <a href="/education/edu-schools.html#content">Okullar neden sadece özgür yazılım kullanmalı</a>

source: <a href="/education/edu-system-india.html#content">The education system in India</a>
tr: <a href="/education/edu-system-india.html#content">Hindistan'daki eğitim sistemi</a>

source: <a href="/education/misc/edu-misc.html#content">Miscellaneous materials</a>
tr: <a href="/education/misc/edu-misc.html#content">Çeşitli materyaller</a>
